{"id": "0", "text": "Autores: Patricio Xavier Moreno Vallejo, Gisel Katerine Bastidas Guacho y Patricio René Moreno Costales", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "1", "text": "Dedicatoria: A los niños Leonel Robayo Moreno, Victoria Robayo Moreno y Benjamín Moreno Bastidas. A quienes inspiraron esta obra: Peter Norvig, Stuart Russell, Brian Yu y Hugo Banda.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "2", "text": "XX INTRODUCCIÓN\nLa inteligencia artificial se encarga de representar las diferentes formas de conocimiento que posee el ser humano. Sus herramientas son la abstracción y la\ninferencia que le permiten crear sistemas de computación no convencionales los cuales son capaces de aprender nuevas tareas en base a la información proporcionada y tomar\ndecisiones en entornos diversos en los cuales debe actuar. La base de la inteligencia artificial se encuentra en el influyente artículo de Alan Turing, \"Computing Machinery and Intelligence\", el cual sostiene que las máquinas\ndeben considerarse inteligentes si pueden comportarse como humanos. Este libro, está dividido en cuatro capítulos, en los cuales se explora los fundamentos y usos de la inteligencia artificial. El primer capítulo profundiza en los\nconceptos básicos de la inteligencia artificial. Analiza su evolución des de la década de\ny se examina cómo otras disciplinas han ayudado para su desarrollo; tales como las\nmatemáticas, filosofía, psicología, lingüística y ciencia de la computación.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "3", "text": "su evolución des de la década de\ny se examina cómo otras disciplinas han ayudado para su desarrollo; tales como las\nmatemáticas, filosofía, psicología, lingüística y ciencia de la computación. Se destaca el impacto de la inteligencia artificial en numerosos sectores como la ciencia, ingeniería,\nempresas, medicina y planificación estratégica. Además, se trata sobre el concepto de agentes inteligentes, se explora sus diseños,\nanalizando su efectividad, identificando varias arquitecturas de programas para agentes. Se busca resolver problemas mediante el razonamiento basado en el conocimiento y su representación des de la perspectiva de la inteligencia simbólica. La lógica es tratada en el capítulo II, constituye una técnica para la representación del conocimiento utilizando proposiciones y operadores lógicos. Mediante las cláusulas\nde Horn se representa el conocimiento, del cual, se parte para poder razonar y luego ejecutar decisiones inteligentes. El Capítulo III, está relacionado a las búsquedas, que constituyen estrategiasesenciales en la inteligencia artificial para alcanzar metas específicas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "4", "text": "y luego ejecutar decisiones inteligentes. El Capítulo III, está relacionado a las búsquedas, que constituyen estrategiasesenciales en la inteligencia artificial para alcanzar metas específicas. Se explora tanto las\nformas de búsquedas no informadas como las informadas, destacando sus diferencias yaplicaciones. También se aborda los conceptos de optimización y árboles de d ecisión. Este libro está diseñado para ofrecerles a ustedes estimados lectores una sólidacomprensión de los fundamentos de la inteligencia artificial. Nuestro objetivo es\nanimarlos a que indaguen el potencial que posee la inteligencia artificial y contribuir a sudesarrollo.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "6", "text": "EXPLORANDO LA INTELIGENCIA ARTIFICIAL\nA la pregunta ¿qué es la inteligencia? la respuesta constituye que es la capacidad de establecer relaciones, las cuales se manifiestan en los seres humanos a través del\npensamiento y la parte intelectual, y en los animales de manera puramente sensorial pormedio de los sentidos (Artasanchez & Joshi, 2020) . Los humanos tenemos múltiples\naspectos que son parte de la inteligencia, como la capacidad de comunicación,\naprendizaje, razonamiento abstracto y resolución de problemas, mientras en los animales la inteligencia está relacionado a poderse adaptar al medi o ambiente, manifestándose\ncomo la capacidad que poseen de la percepción, memoria y toma de decisiones. Entre loshumanos y los animales compartimos rasgos básicos de inteligencia como la conciencia\ndel entorno y la habilidad para responder a estímulos (McCarthy, 1956) . La reflexión simbólica y de autorreflexión nos permite trascender el mundotangible y sensorial, crear cultura y tecnología, ganar experiencia y entender\nconceptualmente el mundo que nos rodea de forma objetiva.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "7", "text": "simbólica y de autorreflexión nos permite trascender el mundotangible y sensorial, crear cultura y tecnología, ganar experiencia y entender\nconceptualmente el mundo que nos rodea de forma objetiva. La aplicación del conocimiento es útil en el análisis y resolución de problemas, en el razonamiento durante\nla toma de decisiones; fomenta la predisposición al descubrimiento, invención,\ncreatividad e innovación. La inteligencia permite a las personas afrontar situacionescomplejas de forma oportuna , rápida y razonada, y tener la capacidad de predecir el\ndesarrollo y los cambios en el entorno que nos rodea. El año 1950 marca el inicio formal de la inteligencia artificial, debido a que fueentonces cuando se buscó dotar a las máquinas de recursos para resolver problemas de\nmanera autónoma, sin depender del apoyo humano. Si bien la noción de máquina ha estado presente durante muchos años, fue Alan Turing quien sentó las bases de la inteligencia artificial a finales de la Segunda Guerra\nMundial, en particular al estudiar científicamente las máquinas inteligentes.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "8", "text": "durante muchos años, fue Alan Turing quien sentó las bases de la inteligencia artificial a finales de la Segunda Guerra\nMundial, en particular al estudiar científicamente las máquinas inteligentes. Turing hab íaestado trabajando en la teoría de la computabilidad des de la década de 1930 y desarrolló\nuna de las primeras computadoras electromecánicas , se le recuerda por haber desarrolladouna máquina para descifrar códigos llamada \"bombe\" en Bletchley Park, Reino Unido,\nque descifraba mensajes encriptados con la máquina alemana Enigma . En octubre de\n1950, mientras trabajaba en la Universidad de Manchester publicó su artículo \"ComputingMachinery and Intelligence\" en la revista Mind (Oxford University Press) , donde\nintrodujo la prueba de Turing, el aprendizaje autónomo, los algoritmos genéticos y el\naprendizaje por refuerzo , sentando las bases conceptuales para que los científicoscomenzaran a explorar cómo crear programas capaces de resolver problemas ellos\nmismos , sin la intervención humana.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "9", "text": "por refuerzo , sentando las bases conceptuales para que los científicoscomenzaran a explorar cómo crear programas capaces de resolver problemas ellos\nmismos , sin la intervención humana. Este artículo es considerado el punto de partida queimpulsó la investigación formal en inteligencia artificial, dando origen a una nueva\ndisciplina dedicada a replicar la inteligencia humana en las máquinas. El legado de Turingha in spirado décadas de avances en aprendizaje automático, procesamiento de lenguaje\nnatural y otros campos clave de la IA. En 1956, el informático John McCarthy (1927 -2011) acuñóel término \"Inteligencia Artificial\" y organizó el influyente\nproyecto de investigación Dartmouth Summer ResearchProject on Artificial Intelligence, en el que participaron\nvarios científicos estadounidenses de matemáticas,\npsicología, ciencias de la computación y teoría de lainformación como Marvin Minsky, Allen Newell, Arthur\nSamuel y Herbert Simon . En aquella época, lascomputadoras se utilizaban para tareas aritméticas con\nherramientas de programación muy primitivas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "10", "text": "como Marvin Minsky, Allen Newell, Arthur\nSamuel y Herbert Simon . En aquella época, lascomputadoras se utilizaban para tareas aritméticas con\nherramientas de programación muy primitivas. El entusiasmo y esfuerzo pionero deMcCarthy y sus colegas en Dartmouth sentaron las bases conceptuales y metodológicas\npara el nacimiento de la IA como campo formal. Su trabajo en esas primitivas condicionesinformáticas es digno de reconocimiento por imp ulsar una disciplina que décadas después\ntendría aplicaciones transformadoras. McCarthy se refiere a esa época como la era de\n\"¡Mira mamá, ahora sin manos!\" . Des de sus inicios, la Inteligencia Artificial (IA) ha tenido como objetivo replicary ampliar las capacidades humanas mediante la imitación y expansión de la inteligencia\nhumana mediante medios y técnicas artificiales. Para lograr este propósito, la IA se hacentrado en el desarrollo de mod elos computacionales que abordan el comportamiento\ninteligente. Su enfoque se centra en la creación de sistemas informáticos capaces derealizar actividades como la percepción, el razonamiento, el aprendizaje, la asociación, la\ntoma de decisiones y la reso lución de problemas complejos.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "11", "text": "la creación de sistemas informáticos capaces derealizar actividades como la percepción, el razonamiento, el aprendizaje, la asociación, la\ntoma de decisiones y la reso lución de problemas complejos. El progreso que se ha alcanzado en la actualidad en IA ha permitido automatizaractividades que antes solo los expertos humanos podían realizar debido a su complejidad\no necesidad de l juicio de un experto , la IA ha redefiniendo lo que entendemos por\nprocesos cognitivos e inteligentes , hiendo más allá de las restricciones inherentes a labiología humana (Whitby, 2009) . La Inteligencia Artificial representa una disciplina dentro de la informática quebusca construir máquinas capaces de funcionar de manera autónoma en entornos\ncomplejos y en constante cambio , creando sistemas que sean capaces de adaptarse yresponder de manera efectiva a situaciones desafiantes.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "12", "text": "1.1 Breve historia cronológica de la inteligencia artificial\nEn 1943, Warren McCulloch y Walter Pitts presentaron el primer modelo de redneuronal artificial capaz de aprender y resolver funciones lógicas. Durante la década de\n1950, la investigación en inteligencia artificial se enfocó principalmente en los juegos. En 1951, Minsky y Edmonds construyeron el primer computador basado en una redneuronal llamado SNARC. En 1956, Arthur Samuel desarrolló el primer programa\nheurístico de juego con capacidad de aprendizaje. Ese mismo año, Allen Newell, HerbertSimon y Cliff Sha w inventaron el programa heurístico llamado Logic Theorist, que\nresolvió correctamente 38 de los primeros 52 teoremas del Principia Mathematica. Estetrabajo marcó el inicio de la investigación en psicología cognitiva utilizando ordenadores. En 1957, Noam Chomsky presentó su obra \"Estructuras Sintácticas\", destacandola importancia de la sintaxis en la investigación del lenguaje formal (Chomsky, 2004) . En\n1958, John McCarthy inventó el lenguaje Lisp, una herramienta utilizada para la investigación en inteligencia artificial que podía procesar tanto valores numéricos como\nsímbolos (McCarthy, 1960) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "13", "text": "En\n1958, John McCarthy inventó el lenguaje Lisp, una herramienta utilizada para la investigación en inteligencia artificial que podía procesar tanto valores numéricos como\nsímbolos (McCarthy, 1960) . McCarthy también fue pionero en el desarrollo del conceptode tiempo compartido (Barski, 2010) . A principios de la década de 1960, la investigación en inteligencia artificial secentró principalmente en algoritmos de búsqueda y resolución de problemas generales. Allen Newell, Herbert Simon y Cliff Shaw desarrollaron un programa llamado GPS\n(General P roblem Solver), que era un sistema definido por objetos y operadores que seaplicaban a dichos objetos. GPS pudo resolver problemas como las Torres de Hanoi. El\nsistema utilizaba reglas heurísticas para aprender a partir de sus propios descubrimientos y seguía un enfoque similar al de los humanos para resolver problemas, estableciendo un\nplan, aplicando axiomas y reglas, y analizando medios y fines para modificar la resolución del problema hasta alcanzar el objetivo. En 1961, Marvin Minsky publicó el artículo \"Pasos hacia la Inteligencia\nArtificial\", estableciendo una terminología unificada para la investigación en inteligencia artificial.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "14", "text": "alcanzar el objetivo. En 1961, Marvin Minsky publicó el artículo \"Pasos hacia la Inteligencia\nArtificial\", estableciendo una terminología unificada para la investigación en inteligencia artificial. En 1962, Frank Rosenblatt desarrolló el Perceptrón, una red neuronal utilizada\npara el reconocimiento visual de patrones, aunque tuvo un impacto limitado en esemomento. En 1965, Edward Feigenbaum, Bruce Buchanan, Joshua Lederberg y CarlDjerassi desarrollaron el primer sistema experto llamado DENDRAL, utilizado para el\nanálisis químico. Ese mismo año, Alan Robinson propuso el principio de la Resolución. En 1968, Ross Quil lian introdujo la Red Semántica como una representación del conocimiento. En 1969, se fundó la Conferencia Conjunta Internacional de Inteligencia\nArtificial (IJCAI), que comenzó a celebrarse cada dos años y, a partir de 2016, se lleva acabo anualmente. La revista Intelligence Artificial se publica bajo los auspicios de la", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "15", "text": "IJCAI des de 1970. Después de la década de 1970, cuando las redes neuronales no cumplieron suspromesas, época conocida como el \"AI hype\", la financiación y las actividades de\ninvestigación se redujeron drásticamente. Esto se conocio como el \"invierno de la IA\". Aprincipios de la década de 1970, el campo de la inteligencia artificial se enfocó hacia el\nestudio y la comprensión del lenguaje natural, así como a la representación avanzada del conocimiento. Durante este período, se observaron progresos significativos en diversas\nramas de la IA, marcando un hito en su desarrollo. En 1972, un avance fundamental fue la publicación de Terry Winograd sobre elprograma SHRDLU. Este programa se distinguió por su habilidad pionera en comprender\nel lenguaje natural, específicamente el inglés, demostrando una comprensión profunda ycontextu al de las interacciones lingüísticas. SHRDLU no solo representó un logro técnico\nimportante, sino que también estableció un marco conceptual crítico para lasinvestigaciones futuras en la comprensión del lenguaje dentro del campo de la inteligencia\nartific ial.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "16", "text": "un logro técnico\nimportante, sino que también estableció un marco conceptual crítico para lasinvestigaciones futuras en la comprensión del lenguaje dentro del campo de la inteligencia\nartific ial. Alain Colmerauer, en la Universidad de Marsella en Francia, desarrolló ellenguaje de programación Prolog en el mismo año. Prolog se convirtió en un lenguaje\nampliamente utilizado en la programación de IA debido a su capacidad para trabajar conla lógica y el razonamiento (Colmerauer & Roussel, 1996) . En 1973, Roger Schank propuso la teoría de la dependencia conceptual, que secentraba en la comprensión del lenguaje natural basada en el conocimiento y la\nrepresentación semántica. Esta teoría contribuyó al avance en el procesamiento del\nlenguaje natural en la IA. Marvin Minsky publicó en 1974 la teoría del sistema de marco (A Framework forRepresenting Knowledge), que fue una contribución importante en la representación del\nconocimiento en la IA (Baader, 2003) . Esta teoría posibilitó que las máquinas ordenarany estructuraran la información de una forma parecida a como lo hacen los seres humanos,\nlo que simplificó el proceso de entendimiento y razonamiento (Minsky & others, 1974) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "17", "text": "las máquinas ordenarany estructuraran la información de una forma parecida a como lo hacen los seres humanos,\nlo que simplificó el proceso de entendimiento y razonamiento (Minsky & others, 1974) . En ese mismo año, Edward Shortliffe desarrolló el sistema experto MYCIN comoparte de su tesis doctoral , implementado en Lisp, era capaz de diagnosticar trastornos en\nla sangre y prescribir medicación correspondiente. Este sistema experto fue un hito en elcampo médico y demostró el potencial de la IA en el diagnóstico y tratamiento de\nenfermedades (Shortliffe, 1977) . Durante esta época, también se desarrollaron sistemasexpertos más avanzados, como el EURISKO, que tenía la capacidad de mejorar\nautomáticamente su conjunto de reglas heurísticas mediante la inducción. Además, en los años 70 se lograron otros avances notables, como lapopularización de los algoritmos genéticos gracias al trabajo de John Holland, y la\nresurrección de las redes neuronales con la creación del algoritmo de retropropagación\n(backpropagation) por parte de Paul John Werbos. Este algoritmo sigue siendoampliamente utilizado en el aprendizaje supervisado para el entrenamiento de redes\nneuronales (Pham & Karaboga, 2012) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "18", "text": "por parte de Paul John Werbos. Este algoritmo sigue siendoampliamente utilizado en el aprendizaje supervisado para el entrenamiento de redes\nneuronales (Pham & Karaboga, 2012) . Asimismo, en esta década se construyó el primerrobot capaz de comprender el inglés y se desarrolló el primer vehículo autónomo,\nmarcando importantes avances en la interacción entre la IA y el mundo físico. En 1977, Edward Feigenbaum publicó un paper titulado \"El arte de la inteligencia artificial: Temas y estudios de caso en ingeniería del conocimiento\" en el quinto IJCAI. En esta publicación dice que la ingeniería del conocimiento es el arte de aplicar losprincipios y herramientas de la investigación en IA para abordar problemas de\naplicaciones difíciles que requieren conocimientos especializados para su solución\n(Brachman & Leves que, 2004) . En 1978, John P. McDermott introdujo un hito en el campo de la inteligencia artificial con el desarrollo del sistema experto R1, marcando uno de los primeros éxitos\nsignificativos en esta área.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "19", "text": ". En 1978, John P. McDermott introdujo un hito en el campo de la inteligencia artificial con el desarrollo del sistema experto R1, marcando uno de los primeros éxitos\nsignificativos en esta área. Compuesto por aproximadamente 2500 reglas, R1 fueimplementado por DEC (Digital Equipment Corporation) para optimizar los procesos de\npedidos de clientes, facilitando la selección de componentes adecuados para sistemas\ninformáticos. Este logro no solo demostró la utilidad práctica de los sistemas expertos,\nsino que también abrió camino para su aplicación en el mundo empresarial. Posteriormente, a mediados de la década de 1980, se produjeron avancesimportantes en el algoritmo de aprendizaje por retroalimentación, originalmente\ndesarrollado por Bryson y Ho en 1969. Estas mejoras fueron importantes para el progresode los métodos de aprendizaje automático, potenciando significativamente el rendimiento\ny la eficiencia en el entrenamiento de sistemas basados en IA, lo que representó un avanceclave en la evolución de las técnicas de inteligencia artificial. Durante los años 80, la Inteligencia Artificial se consolida como una ciencia en símisma.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "20", "text": "basados en IA, lo que representó un avanceclave en la evolución de las técnicas de inteligencia artificial. Durante los años 80, la Inteligencia Artificial se consolida como una ciencia en símisma. Judea Pearl en 1982 promueve la idea de los sistemas expertos normativos que se\nbasan en normas y principios de racionalidad formal, los cuales actúan racionalmente deacuerdo con las leyes de la teoría de la decisión, sin intentar replicar directamente el\nproceso de razonamiento humano. En 1986, Eric Horvitz y David Heckerman que hanrealizado contribuciones significativas en áreas como el aprendizaje automático, la toma\nde decisiones basada en datos y la bioinformática, respaldaron la idea de Pearl . En ese mismo año, Rumelhart y McClelland publicaron aplicaciones dealgoritmos de aprendizaje en informática y psicología, lo que dio lugar al establecimiento\ndel enfoque del conexionismo basado en redes neuronales. Este enfoque revivió el interésen las r edes neuronales como una herramienta poderosa para el aprendizaje automático y\nestableció una nueva dirección en la investigación y desarrollo de IA.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "21", "text": "Este enfoque revivió el interésen las r edes neuronales como una herramienta poderosa para el aprendizaje automático y\nestableció una nueva dirección en la investigación y desarrollo de IA. En 1988, Judea Pearl publica el influyente texto \"Probabilistic Reasoning inIntelligent Systems\", que incorpora conceptos de probabilidades y teoría de decisiones en\nel campo de la inteligencia artificial. Este trabajo fue fundamental para avanzar en el usode modelos probabilísticos en la toma de decisiones en sistemas inteligentes. En 1995, Russelll y Norvig retomaron el trabajo en agentes totales, sistemas quebuscan encontrar soluciones a partir de información de entrada continua. En 1997, la\ncomputadora Deep Blue de IBM venció al ajedrecista ruso Garry Kasparov consideradouno de los mejores jugadores de ajedrez, este hecho situó a la inteligencia artificial como\nprotagonista en el ámbito tecnológico y demostró el potencial que tie ne al desafiar aexpertos humanos en juegos complejos. En el año 2000, se construyó el robot ASIMO, que era capaz de desplazarse en\ndos pies, dar la mano y contestar a preguntas simples.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "22", "text": "que tie ne al desafiar aexpertos humanos en juegos complejos. En el año 2000, se construyó el robot ASIMO, que era capaz de desplazarse en\ndos pies, dar la mano y contestar a preguntas simples. En 2002, la empresa Cognitec\ndesarroll a el primer sistema comercial de reconocimiento facial a partir de imágenes ovideos . En 200 6, se presentó el prototipo del robot programable y autónomo NAO. En\n2009, se lograron desarrollar robots sociales que son capaces de detectar emociones einteractuar con niños autistas. A partir del 2010 hasta la actualidad, se ha desarrollado el aprendizaje profundo\n(DL Deep Learning ), que es un tipo especial de red neuronal que tiene más de una capaoculta. Esto solo es posible con el aumento de la potencia informática, especialmente de\nlas unidades de procesamiento gráfico (GPU) y algoritmos mejorados. Hasta ahora, el DLha superado muchos otros algoritmos en un gran conjunto de datos.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "23", "text": "de la potencia informática, especialmente de\nlas unidades de procesamiento gráfico (GPU) y algoritmos mejorados. Hasta ahora, el DLha superado muchos otros algoritmos en un gran conjunto de datos. En 2014, se produjo un acontecimiento importante en el campo de la inteligencia artificial cuando el chatbot Eugene Goostman logró superar el test de Turing, considerado\nun indicador crítico en la evaluación de la capacidad de las máquinas para imitar lainteligencia humana en el diálogo. Este logro no solo demostró avances significativos en\nel desarrollo de sistemas de conversación automatizados, sino que también abrió undebate sobre la complejidad y la verosimilitud de las interacciones entre humanos y\nmáquinas, marcando un punto de referencia en la historia de la inteligencia artificial. En el año 2016, AlphaGo, un programa de IA creado por DeepMind Technologies,\nalcanzó notoriedad mundial al vencer a Lee Sedol, un campeón global en Go, unmilenario y desafiante juego de estrategia chino caracterizado por su alta complejidad y\nlas numerosas posibilidades que ofrece cada partida.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "24", "text": "mundial al vencer a Lee Sedol, un campeón global en Go, unmilenario y desafiante juego de estrategia chino caracterizado por su alta complejidad y\nlas numerosas posibilidades que ofrece cada partida. Este logro marcó un p unto deinflexión, generando un renovado interés y avances significativos en el ámbito de la\ninteligencia artificial, evidenciando así su capacidad para abordar tareas de grancomplejidad y para la toma de decisiones estratégicas. Un hito importante en la intersección de la inteligencia artificial y la biología sealcanzó en 2020 gracias a DeepMind, los creadores de AlphaGo. Desarrollaron\nAlphaFold, una versión mejorada de su sistema de IA, que logró descifrar un desafío quehabía p erplejado a los biólogos por más de cinco décadas: el plegamiento de proteínas. Este fenómeno, en el que las proteínas obtienen su forma tridimensional específica, esimportante para comprender su función dentro del organismo. Este avance es\nfundamental, d ebido a que desentraña cómo las células operan y cómo se manifiestandiversas enfermedades a nivel molecular, debido a la extraordinaria complejidad de este\nproceso.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "25", "text": "Este avance es\nfundamental, d ebido a que desentraña cómo las células operan y cómo se manifiestandiversas enfermedades a nivel molecular, debido a la extraordinaria complejidad de este\nproceso. A partir del 2021, los avances en inteligencia artificial ha n sido impresionante s,\ntransformando diversos sectores de manera significativa. Un claro ejemplo es el modeloGPT de OpenAI, que ha marcado un antes y un después en la forma en que las máquinas\nentienden y generan lenguaje, siendo útil en una variedad de aplicaciones que inclu yendes de la generación automatizada de contenido hasta soporte en servicios al cliente. Por\notro lado, los modelos como BERT, desarrollados por Google, han revolucionado lamanera en que se procesa el lenguaje en búsquedas en línea y otras aplicaciones, logrando\nuna mayor precisión y relevancia en las respuestas brindadas. IBM Watson Health hatransformado el sector médico con su capacidad para analizar extensos volúmenes de\ndatos médicos, contribuyendo a diagnósticos más acertados y tratamientospersonalizados.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "26", "text": "IBM Watson Health hatransformado el sector médico con su capacidad para analizar extensos volúmenes de\ndatos médicos, contribuyendo a diagnósticos más acertados y tratamientospersonalizados. La empresa Boston Dynamics ha sobresalido con sus robots Atlas y Spot, que sehan convertido en herramientas importantes para tareas de inspección y rescate, así como\nen aplicaciones industriales, demostrando la evolución y adaptabilidad de la robótica. Hugging Face, ha permitido la accesibilidad al aprendizaje profundo y proce samiento dellenguaje natural a un público más amplio . En el terreno creativo, proyectos como AIVA\n(Artificial Intelligence Virtual Artist) están trabajando en la composición musicalmediante la inteligencia artificial y DeepArt explora nuevas posibilidades en el arte visual\na través de la tecnología de IA. Google AI for Earth está utilizando la inteligencia artificialpara el análisis de datos medioambientales , en la búsqueda de soluciones sostenibles, que\nabord en los retos más críticos del cambio climático.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "27", "text": "AI for Earth está utilizando la inteligencia artificialpara el análisis de datos medioambientales , en la búsqueda de soluciones sostenibles, que\nabord en los retos más críticos del cambio climático. El campo de la inteligencia artificial se suele confund ir con la ciencia de datos, elbig data y la minería de datos , pero en realidad representan disciplinas di ferentes . La\nciencia de datos se enfoca principalmente en la manipulación y el análisis de datos,\nincluyendo el manejo de grandes volúmenes de datos (big data) y la minería de datos ; deforma frecuente emplea técnicas de aprendizaje automático (Machine Learning) y\naprendizaje profundo (Deep Learing) para el procesamiento de datos.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "28", "text": "de datos (big data) y la minería de datos ; deforma frecuente emplea técnicas de aprendizaje automático (Machine Learning) y\naprendizaje profundo (Deep Learing) para el procesamiento de datos. La transformación digital ha generado una inmensa cantidad de datos, los cualesprovienen de diversas fuentes, al no poder ser analizados de manera eficiente con las\nherramientas y algoritmos tradicionales de bases de datos; la inteligencia artificial, el bigdata y la minería de datos han desarrollo algoritmos sofisticados ( algoritmos de\naprendizaje automático, algoritmos de clasificación y regresión, algoritmos de\nagrupamiento y algoritmos de minería de datos), que posibilitan a las empresas tomardecisiones basadas en datos y brindar a los usuarios acceso a información relevante de\nmaner a rápida y cómoda en sus actividades diarias.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "29", "text": "de minería de datos), que posibilitan a las empresas tomardecisiones basadas en datos y brindar a los usuarios acceso a información relevante de\nmaner a rápida y cómoda en sus actividades diarias. Google Search y Google Maps proporcionan resultados de búsqueda relevantes ysugerencias de navegación personalizadas comparado con productos similares, Spotify\nrecomienda música que se ajuste a los gustos y preferencias del usuario y Netflix empleala IA para sugerir películas y series que probablemente interesen al usuario, basándose en\nsus visualizaciones anteriores y preferencias. Todas estas plataformas popularesincorporan algoritmos avanzados de inteligencia artificial para realizar su trabajo. Al usar uno de los siguientes asistentes personales, Alexa de Amazon, Siri deiPhone, Cortana de Microsoft, Bixby de Samsung o Google Assistant, observamos que\nentiende lo que hablamos, ejecutando de forma eficiente la tarea solicitada. Las redessociales como Facebook, Pinterest y Google Fotos, tienen incorporado el reconocimiento\nfacial, a través de técnicas sofisticadas de visión por computadora que mejora lainteractividad y seguridad de sus usuarios.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "30", "text": "Facebook, Pinterest y Google Fotos, tienen incorporado el reconocimiento\nfacial, a través de técnicas sofisticadas de visión por computadora que mejora lainteractividad y seguridad de sus usuarios. En el ámbito empresarial, la robótica, los sistemas expertos y el aprendizajeautomático están transformando los procesos y brindando oportunidades de innovación\nen los negocios. Actualmente, se están desarrollando herramientas y plataformas de ciencia dedatos que permiten la aplicación de algoritmos de inteligencia artificial. Algunos\nejemplos de estas plataformas incluyen RapidMiner, Anaconda y Python. Los líderes de la industria tecnológica, como Google, Microsoft, Meta Platforms ,\nAmazon , Oracle y OpenAI están profundamente comprometidos con la inteligencia artificial. Esta tecnología se está integrando profundamente en diversos aspectos de\nnuestra vida cotidiana, influyendo en nuestras decisiones y siendo importante en lasestrategias empresariales, la salud pública, la seguridad y las finanzas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "31", "text": "profundamente en diversos aspectos de\nnuestra vida cotidiana, influyendo en nuestras decisiones y siendo importante en lasestrategias empresariales, la salud pública, la seguridad y las finanzas. En el futuro\ndebemos esp erar un desarrollo significativo en aplicaciones web, videojuegos y robóticaautónoma , veremos cada vez más vehículos autónomos circulando por las calles, robots\nsociales ayudando a las personas en su vida diaria y exploradores planetarios llegando alugares más lejanos en el universo. Asimismo, las aplicaciones en el ámbito\nmedioambiental y el ahorro energético serán de gran importancia, al igual que en los\ncampos de la economía, la sociología y el arte (Lee & Qiufan, 2021) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "32", "text": "1.2 Contribuciones de las ciencias a la inteligencia artificial\nVarias ciencias han aportado al desarrollo de la Inteligencia Artificial , entre ellasse tiene:\nLa filosofía ha planteado diversas teorías sobre el razonamiento y el aprendizaje,\nconcibiendo a la mente como una máquina que funciona a partir del conocimiento ,\ncodificado en un lenguaje interno y al considerar que el pensamiento sirve para determinarcuál es la acción correcta que se debe emprender (McCarthy, 1990) . Un parte relevante en el desarrollo del razonamiento deductivo es la lógicasilogística propuesta por el filósofo Aristóteles, considerada el primer sistema formal de\nrazonamiento deductivo , la cual establece reglas precisas para derivar conclusionesválidas a partir de premisas , esto a contribuido al desarrollo posterior de la lógica y ha\ninfluido en los fundamentos de la inteligencia artificial.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "33", "text": "reglas precisas para derivar conclusionesválidas a partir de premisas , esto a contribuido al desarrollo posterior de la lógica y ha\ninfluido en los fundamentos de la inteligencia artificial. Des de la perspectiva de la inteligencia artificial, se han explorado puntos de vistamás avanzados y sofisticados para comprender el razonamiento y el aprendizaje ; que\ninvolucran el uso de algoritmos de aprendizaje automático, redes neuronales y técnicas de procesamiento de lenguaje natural, permitiendo a las máquinas no solo realizar\nrazonamiento deductivo, sino también abordar problemas complejos de manera máseficien te y aproximarse a la toma de decisiones basadas en datos y modelos de\nconocimiento. Las matemáticas son fundamentales en el desarrollo de teorías formalesrelacionadas con la lógica, las probabilidades, la teoría de decisiones y la computación. La lógica matemática permite tratar con declaraciones y razonamientos que pueden serverdaderos o falsos, mient ras que la teoría de probabilidades aborda situaciones de\nincertidumbre y riesgo.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "34", "text": "La lógica matemática permite tratar con declaraciones y razonamientos que pueden serverdaderos o falsos, mient ras que la teoría de probabilidades aborda situaciones de\nincertidumbre y riesgo. En el libro \"Una investigación de las leyes del pensamiento\" de George Boole seencuentra el desarrollo del álgebra booleana que se ha convertido en una herramienta\nesencial en la lógica digital y la computación para la representación de reglas básicas derazonamiento en actividades mentales, permitiendo manipular datos y realizar\noperaciones lógicas en las computadoras y otros dispositivos electrónicos. Las matemáticas siguen siendo esenciales en el ámbito de la inteligencia artificial. Las redes neuronales y los algoritmos de aprendizaje automático son modelos\nmatemáticos que permiten a las máquinas aprender de los datos y realizar inferenciascomplejas para tomar decisiones o realizar acciones basadas en la información procesada.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "35", "text": "automático son modelos\nmatemáticos que permiten a las máquinas aprender de los datos y realizar inferenciascomplejas para tomar decisiones o realizar acciones basadas en la información procesada. La teoría de la computación proporciona el marco teórico y los principios queguían la creación y el funcionamiento de algoritmos que minimicen el uso de recursos,\ntiempo de computación y memoria; mientras que los fundamentos matemáticos aportanlas herram ientas y técnicas necesarias para formular y resolver problemas de manera\nlógica y precisa (Domkin, 2021) . La psicología tiene gran importancia en el estudio y entendimiento de la mentehumana, al ser una ciencia, se enfoca en explorar y comprender los procesos cognitivos\n(como el pensamiento, la memoria, la percepción y la toma de decisiones) y emocionales\n(los sentimiento s y las emociones) que caracterizan el comportamiento humano. La idea de que los humanos procesan información ha contribuido a mode lar lossistemas de inteligencia artificial, inspirándose en la forma en que los humanos pensamos\ny tomamos decisiones.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "36", "text": "humano. La idea de que los humanos procesan información ha contribuido a mode lar lossistemas de inteligencia artificial, inspirándose en la forma en que los humanos pensamos\ny tomamos decisiones. Los enfoques teóricos y conceptuales de la psicología sobre elprocesamiento del lenguaje natural, la percepción visual y la toma de decisiones, han\ninfluido en el diseño de algoritmos y modelos utilizados en los sistemas de la inteligencia artificial. La IA no se centra exclusivamente en imitar la mente humana. También incorporaelementos de matemáticas, estadística e informática, lo que permite a las máquinas\nrealizar tareas cognitivas específicas y tomar decisiones en diversos contextos, a veces demanera diferente a como lo haría un ser humano. La lingüística es importante en la\ninteligencia artificial al proporcionar teorías y herramientas para comprender la estructuray el significado del lenguaje humano. El lenguaje es un componente fundamental de la\ncomunicación y su comprensión y generación son elementos esenciales en muchossistemas de in teligencia artificial.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "37", "text": "el significado del lenguaje humano. El lenguaje es un componente fundamental de la\ncomunicación y su comprensión y generación son elementos esenciales en muchossistemas de in teligencia artificial. La lingüística es la ciencia del lenguaje que posee un enfoque sistemático para elanálisis de la gramática (estructura y reglas del lenguaje), semántica (significado de las\npalabras y frases) y pragmática (uso del lenguaje en contextos específicos) del lenguaje. El est udio detallado de las reglas y patrones lingüísticos, ha permitido los avancestecnológicos en el campo de la inteligencia artificial y la computación, permitiendo a las\nmáquinas entender y generar lenguaje, así como para producir texto compr ensible para\nlos humanos. La colaboración entre la lingüística y la inteligencia artificial ha sido un factorimportante para el progreso del procesamiento del lenguaje natural (PLN), que permite a\nlas máquinas entender, interpretar y generar lenguaje humano de forma similar a cómo lohacen las personas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "38", "text": "para el progreso del procesamiento del lenguaje natural (PLN), que permite a\nlas máquinas entender, interpretar y generar lenguaje humano de forma similar a cómo lohacen las personas. Otras aplicaciones son la traducción automática; los chatbots, que\npueden interactuar en lenguaje natural con los usuarios; y los sistemas de diálogo, quefacilitan una comunicación fluida y natural con las máquinas. La lingüística ha sido fundamental en la creación de recursos como bases de datosléxicas (listas de palabras y sus significados), corpus textuales (grandes colecciones de\ntextos escritos o transcripciones de habla) y modelos de conocimiento lingüístico. Estosrecursos son indispensables para entrenar y mejorar los sistemas de IA, proporcionando\nla información necesaria para que las máquinas aprendan y entiendan el lenguaje humano. La ciencia de la computación proporciona los lenguajes de programación queson el medio por el cual se escriben y se ejecutan los algoritmos de inteligencia artificial\ny los marcos de desarrollo, que ofrecen estructuras y librerías predefinidas para facilitarla creación de aplicacio nes de inteligencia artificial.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "39", "text": "ejecutan los algoritmos de inteligencia artificial\ny los marcos de desarrollo, que ofrecen estructuras y librerías predefinidas para facilitarla creación de aplicacio nes de inteligencia artificial. Alan Turing es una figura fundamental en el origen de la ciencia de lacomputación debido a sus contribuciones innovadoras y su visión de lo que podrían ser\nlas computadoras y su funcionamiento. Sus teorías y modelos proporcionan el marcoconceptual para c omprender cómo las máquinas pueden no solo procesar información,\nsino también realizar tareas que requieren algún nivel de inteligencia, como elaprendizaje, el razonamiento y la adaptación. En el ámbito de la IA, los programas y algoritmos son fundamentales paracapacitar a las máquinas para que realicen tareas consideradas inteligentes como la\nresolución de problemas hasta la imitación de comportamientos humanos como elaprendizaje y la toma de decisiones. Los programas demandan una cantidad significativa\nde recursos computacionales, incluyendo un alto poder de procesamiento y una grancapacidad de memoria.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "40", "text": "como elaprendizaje y la toma de decisiones. Los programas demandan una cantidad significativa\nde recursos computacionales, incluyendo un alto poder de procesamiento y una grancapacidad de memoria. La eficiencia de un algoritmo se refiere a cuán bien utiliza los\nrecursos disponibles (como tiempo de cómputo y memoria) para lograr sus objetivosLa ciencia de la computación ha avanzado en el procesamiento de datos\n(capacidad de manejar y transformar datos en información útil), el aprendizaje automático\n(sistemas capaces de aprender y mejorar a partir de la experiencia), la optimización de\nalgoritmos (velocidad y uso de recursos) y la gestión de grandes volúmenes de\ninformación (procesar y analizar grandes conjuntos de datos). La neurociencia se centra en entender el funcionamiento del cerebro humano aniveles: molecular, celular y de comportamiento. Este estudio permite desarrollar\nmodelos y principios que son aplicados en la creación de inteligencia artificial. También,\nproporciona informació n valiosa sobre cómo se procesa el lenguaje en el cerebro humano,\nque es utilizado en el procesamiento de lenguaje natural dentro de la inteligencia artificial.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "41", "text": "También,\nproporciona informació n valiosa sobre cómo se procesa el lenguaje en el cerebro humano,\nque es utilizado en el procesamiento de lenguaje natural dentro de la inteligencia artificial. La neurociencia ha permitido obtener un conocimiento más profundo de lafuncionalidad cerebral y de los procesos de procesamiento de información dentro del\ncerebro. Este conocimiento es valioso para los expertos en inteligencia artificial, debidoa que les ofrece inspiración basada en los mecanismos y procesos cerebrales reales para\ndesarrollar algoritmos y modelos en el campo del aprendizaje automático. La neurociencia ha revelado principios fundamentales sobre cómo funcionan lasredes neuronales en el cerebro y cómo este tiene la capacidad de cambiar y adaptarse a\ntravés del aprendizaje (plasticidad cerebral). Estos descubrimientos son importantes parael diseño de algoritmos en el aprendizaje automático, especialmente en el desarrollo de\nredes neuronales artificiales. Estos algoritmos buscan imitar los principios biológicos delcerebro humano para mejorar la eficiencia y capacidad de procesamiento en la\ninteligencia artificial.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "42", "text": "de\nredes neuronales artificiales. Estos algoritmos buscan imitar los principios biológicos delcerebro humano para mejorar la eficiencia y capacidad de procesamiento en la\ninteligencia artificial. La ciencia cognitiva es decisiva en el estudio de las actividades mentaleshumanas, como la percepción, el aprendizaje, la memoria, el pensamiento y la conciencia. Esta disciplina integra conocimientos de varias áreas de estudio como la psicología quecontribuye con la compre nsión del comportamiento y los procesos mentales; la lingüística\nque aporta conocimientos sobre el lenguaje y su relación con el pensamiento; la filosofíaque ofrece marcos conceptuales y éticos; la neurociencia que brinda información s obre la\nestructura y función del cerebro; y la inteligencia artificial que ayuda a mode lar y simularprocesos cognitivos. Juntas, estas disciplinas permiten una comprensión más completa de\ncómo se desarrollan y trabajan las actividades mentales en los seres humanos.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "43", "text": "que ayuda a mode lar y simularprocesos cognitivos. Juntas, estas disciplinas permiten una comprensión más completa de\ncómo se desarrollan y trabajan las actividades mentales en los seres humanos. La investigación en ciencia cognitiva busca descubrir cómo funcionaninternamente los procesos a través de los cuales los seres humanos reciben, procesan y\ncomprenden la información que obtienen de su entorno para desarrollar máquinas quepuedan procesar e interpretar información sensorial (como imágenes, sonidos, texturas)\nde manera similar a cómo lo hace un ser humano. La investigación en ciencia cognitiva también ha explorado el pensamientohumano, incluyendo la resolución de problemas, la toma de decisiones y el razonamiento. Estos procesos cognitivos han sido estudiados y mode lados para desarrollar algoritmos ysistem as de inteligencia artificial capaces de realizar tareas complejas de manera lógica y\neficiente.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "44", "text": "Estos procesos cognitivos han sido estudiados y mode lados para desarrollar algoritmos ysistem as de inteligencia artificial capaces de realizar tareas complejas de manera lógica y\neficiente. Los descubrimientos, que detallan los procesos mediante los cuales los humanosadquieren conocimientos (aprendizaje), los retienen (memoria) y los recuperan cuando es\nnecesario, proporcionan una base sólida para la creación de modelos sofisticados en elcampo del aprendizaje automático. Se ha explorado el pensamiento humano en la búsqueda de entender cómo loshumanos abordan y solucionan situaciones complejas, y cómo procesan información para\nllegar a conclusiones con el objetivo de crear máquinas con inteligencia artificial queimiten el comportamiento humano. Comprender qué es la conciencia y cómo funciona sigue siendo un desafío enbúsqueda de entender en profundidad la mente humana, a pesar de estos esfuerzos que se\nhan hecho en la inteligencia artificial, simular completamente la conciencia humana es un desa fío significativo y aún no se ha logrado.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "45", "text": "profundidad la mente humana, a pesar de estos esfuerzos que se\nhan hecho en la inteligencia artificial, simular completamente la conciencia humana es un desa fío significativo y aún no se ha logrado. Los modelos actuales pueden aproximarse\na ciertos aspectos de la conciencia, pero la experiencia subjetiva y la autoconciencia plenason elementos particularmente difíciles de replicar en una máquina (McDermott, 2007) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "46", "text": "1.3 Areas de investigación de la inteligencia artificial\nLa inteligencia artificial (IA) representa un cambio significativo y un avanceconsiderable en el campo de la tecnología informática, muestra el progreso que ha tenido\nen comparación con generaciones anteriores , que se centraban principalmente en realizarcálculos numéricos (como los usados en aplicaciones científicas o comerciales),\nactualmente la IA se orienta hacia tareas más complejas y abstractas, que incluyen lamanipulación simbólica (trabajar con informa ción representada mediante símbolos, como\nen el procesamiento del lenguaje) y la emulación de comportamientos inteligentes\n(intentar replicar o simular formas de intel igencia similares a las humanas, como elreconocimiento de patrones, la toma de decisiones, y el aprendizaje). Las áreas de la IA en las cuales se está investigando en la actualidad sonpresentadas en la\ndel conocimiento en la inteligencia artificial que son: la representación simbólica y la\nrepresentación no simbólica y también se puede observar combinadas de las dosrepresentaciones.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "47", "text": "en la\ndel conocimiento en la inteligencia artificial que son: la representación simbólica y la\nrepresentación no simbólica y también se puede observar combinadas de las dosrepresentaciones. La representación simbólica es un método para mode lar y manipular elconocimiento utilizando símbolos (palabras, números o iconos) que se eligen y se utilizan\nde manera estructurada y lógica. Por ejemplo, en un sistema simbólico, una palabra como\n\"elefante \" = “mamífero paquidermo de gran tamaño” es un símbolo que representa unconcepto específico en el mundo real. La representación no simbólica, en lugar de usar reglas específicas y símbolosdefinidos, utiliza patrones y modelos matemáticos o estadísticos que aprenden de los\nejemplos y datos. Por ejemplo, en una red neuronal utilizada para el reconocimiento deimágenes, no hay un símbolo específico para \"elefante\", sino que el conocimiento sobre\nqué constituyen estos animales se aprende (de muchas fotos de elefantes) y se almacenaen los patrones de conexión entre las neuronas de la red.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "48", "text": "16 2. Procesamiento del Lenguaje Natural (PLN): Se enfoca en la comprensión y\ngeneración de lenguaje humano mediante reglas gramaticales y semánticas. 3. Robótica Cognitiva: Los robots son capaces de interpretar su entorno y reconocerlos objetos y situaciones que encuentran, tienen la capacidad de interactuar\nfísicamente con su entorno, toma ndo o mov iendo los objetos (Franceschetti,\n2018) . 4. Razonamiento Automatizado: Las máquinas o sistemas informáticos son capaces de pensar y llegar a conclusiones de manera similar a como lo haría un ser\nhumano , proceso que lo realiza n de manera automática y estructurada medianteun programa o algoritmo . 5. Interacción Hombre -Máquina: Es el estudio y la parte práctica de cómo laspersonas se comunican o interactúan con las computadoras y otros dispositivos\ntecnológicos, buscando que sea fluido y sencillo como hablar o interactuar conotro ser humano. 6. Ontologías y Representación del Conocimiento: Se trata de crear modelos quepuedan representar el conocimiento de manera que las computadoras lo entiendan\ny lo manejen eficientemente, utilizando entidades, atributos, y relacionessimbólicas (Poole & Mackworth, 2010) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "49", "text": "quepuedan representar el conocimiento de manera que las computadoras lo entiendan\ny lo manejen eficientemente, utilizando entidades, atributos, y relacionessimbólicas (Poole & Mackworth, 2010) . Representación No -Simbólica :\n1. Aprendizaje Automático: Se tienen los siguientes tipos de aprendizaje. a) Aprendizaje Supervisado: Estos modelos de inteligencia artificial se utilizan pararealizar tareas de clasificación o regresión, se entrena n usando un conjunto de\ndatos que han sido etiquetados con anterioridad (Xiao, 2022) . b) Aprendizaje No Supervisado: Los modelos trabajan identificando patrones endatos que no han sido etiquetados, para locual usan técnicas de grupamiento o\nreducción de dimensionalidad . c) Aprendizaje por Refuerzo: Son modelos (agentes) que aprenden a tomardecisiones mediante experimentación e interacción con el medio ambiente ,\nrecib en recompensas o penalizaciones en función de las acciones que realizan. 2. Redes Neuronales y Aprendizaje Profundo: Es un tipo de tecnología que intentaimitar la forma en que el cerebro humano procesa la información .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "50", "text": "en función de las acciones que realizan. 2. Redes Neuronales y Aprendizaje Profundo: Es un tipo de tecnología que intentaimitar la forma en que el cerebro humano procesa la información . Las redes\nneuronales son sometidas a un proceso llamado \"entrenamiento\", durante el cual\nla red ajusta sus parámetros internos (llamados \"pesos sinápticos \") para mejorar\nsu capacidad de realizar la tarea deseada (Haykin, 2009) . 3. Visión por Computadora: Busca que las computadoras procesen y analicen elcontenido visual (imágenes, videos) obtenido mediante cámaras y sensores del\nmundo que les rodea . 4. Procesamiento de Lenguaje Natural basado en Aprendizaje Automático: Usamodelos estadísticos y redes neuronales para el entendimiento , interpretación y\ngeneración de lenguaje humano de manera efectiva. 5. Sistemas de Recomendación: Son sistemas informáticos que se basan enalgoritmos de aprendizaje profundo y estan diseñados para sugerir\nautomáticamente productos, servicios, información o acciones a los usuarios. 6. Bioinformática y Análisis de Datos Biomédicos: Utiliza técnicas informáticas yestadísticas para entender y analizar los datos.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "51", "text": "productos, servicios, información o acciones a los usuarios. 6. Bioinformática y Análisis de Datos Biomédicos: Utiliza técnicas informáticas yestadísticas para entender y analizar los datos. La bioinformática se centra en el\nanálisis de datos a nivel molecular, como los genes y proteínas, mientras que elanálisis de datos biomédicos incluye datos relacionados con la salud y la biología. 7. Análisis Predictivo y Minería de Datos: Son t écnicas que buscan patrones (comotendencias comunes o repetitivas) , correlaciones (relaciones entre diferentes\nvariables) y conocimientos a partir de grandes volúmenes de datos para predecirtendencias o comportamientos futuros. 8. Integración de Conocimiento en Modelos de Aprendizaje Automático: Se refiereal proceso de aprovechar la información y estructuras que ya existen he\nincorporárlas en los modelos de aprendizaje automático. 9. Simulación y Mode lado Basado en Agentes: Se usa agentes autónomos parasimular comportamientos y sistemas complejos y dinámicos. Cada agente en el\nmodelo representa una entidad con su propio conjunto de características y reglas de comportamiento.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "52", "text": "agentes autónomos parasimular comportamientos y sistemas complejos y dinámicos. Cada agente en el\nmodelo representa una entidad con su propio conjunto de características y reglas de comportamiento. Esta técnica es útil en el campo de la inteligenci a artificial\ndistribuida, donde se busca comprender y replicar comportamientos colectivos ode enjambre, como los observados en la naturaleza. 10. Robótica Basada en Aprendizaje Automático: Incorpora técnicas de aprendizajeautomático en la robótica para mejorar las capacidades de percepción y decisión\nde los robots, especialmente en entornos que son dinámicos y no estructurados\n(Franceschetti, 2018) . Representación Simbólica y Representación No -Simbólica:\n1. Procesamiento del Lenguaje Natural (PLN) Híbrido: Estudia cómo hacer que lascomputadoras sean capaces de analizar, entender y generar lenguaje humano de\nforma automática. Usa métodos simbólicos como el análisis sintáctico basado enreglas gramaticales y la representación semántic a basad a en reglas . Combina con\nmétodos no simbólicos, como el aprendizaje profundo . Se emplean en latraducción automática entre idiomas , el análisis de sentimientos y la generación\nde texto. 2.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "53", "text": "a basad a en reglas . Combina con\nmétodos no simbólicos, como el aprendizaje profundo . Se emplean en latraducción automática entre idiomas , el análisis de sentimientos y la generación\nde texto. 2. Sistemas Expertos Mejorados: Los sistemas expertos tradicionales, basados enconocimiento simbólico y reglas, se pueden enriquecer con técnicas de\naprendizaje automático para manejar la incertidumbre , aprender patrones ycapturen excepciones al manejar grandes volúmenes de datos. 3. Robótica Cognitiva Avanzada: Los robots utilizan algoritmos de aprendizajeprofundo para interpretar lo que perciben a través de sus sensores y están\nequipados con sistemas que siguen reglas predefinidas para planificar sus acciones y tomar decisiones (Franceschetti, 2018) . Estos robots pueden manejar una\nvariedad de situaciones y tareas en diferentes entornos, realizando ajustes segúnsea necesario para adaptarse a cambios inesperados en su entorno . 4.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "54", "text": "2018) . Estos robots pueden manejar una\nvariedad de situaciones y tareas en diferentes entornos, realizando ajustes segúnsea necesario para adaptarse a cambios inesperados en su entorno . 4. Sistemas de Recomendación Híbridos: Combinan el análisis de patrones decomportamiento de usuarios (aprendizaje no simbólico) con reglas basadas en\nconocimiento específico del dominio ( aprendizaje simbólico) para proporcionarrecomendaciones más precisas y contextuales. Son asistentes inteligentes que te\nsugiere cosas basándose en lo que te gusta y en conocimientos específicos de unárea determinada. 5. Integración de Conocimiento en Aprendizaje Automático: Se utiliza en p royectos que buscan integrar bases de conocimiento estructuradas (simbólicas) dentro de\nmodelos de aprendizaje automático (no simbólicos) para mejorar la interpretación y generalización de los modelos. 6. Ontologías en Aprendizaje Automático: Se usa ontologías y estructuras de conocimiento simbólico para guiar y mejorar el proceso de aprendizaje en\nmodelos no simbólicos, especialmente en dominios específicos como la medicinao la biología (García Serrano, 2012) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "55", "text": "19 7. Inteligencia Artificial Explicable (XAI): Busca desarrollar modelos de IA,\nespecialmente los basados en aprendizaje profundo, que puedan explicar susdecisiones y procesos de una manera comprensible para los humanos, a menudo\nintegrando elementos simbólico s en la explicación de modelos no simbólicos.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "56", "text": "1.4 Influencia significativa de la inteligencia artificial\nLa importancia de la inteligencia artificial radica en el hecho de que se relacionacon la mayoría de campos de investigación a través de diferentes disciplinas tales como:\nlas ciencias de la ingeniería (ayuda a diseñar sistemas más eficientes y seguros), laeconomía (permite analizar tendencias de mercado y predecir cambios económicos) y la\nmedicina (contribuye al diagnóstico y tratamiento de enfermedades, e incluso en la investigación de nuevos medicamentos), siendo usada la IA como un medio para hacer\nfrente a muy complicados y difíciles procesos de cómputo, así como a los problemascognitivos. Al ser la IA una de las principales corrientes de tratamiento de la información,\npuede ahora ofrecer soluciones a los problemas utilizando los avances e innovacio nesentre una amplia gama de sub -áreas que inducen el pensamiento y razonamiento en los\nmodelos y sistemas desarrollados.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "57", "text": "ahora ofrecer soluciones a los problemas utilizando los avances e innovacio nesentre una amplia gama de sub -áreas que inducen el pensamiento y razonamiento en los\nmodelos y sistemas desarrollados. Se espera que las empresas que utilizan aplicaciones de Inteligencia Artificialmejoren la capacidad de analizar los datos a través de múltiples variables, puedan detectar\nfraudes y gestionen de mejor manera las relaciones con los clientes para obtener unaventaja competitiva. Altos directivos de muchas empresas utilizan sistemas de planificación estratégicabasados en IA para tener una asistencia en funciones como: análisis de la competencia, el\ndespliegue de tecnología y la asignación de recursos. También se utilizan programas paraayudar en el diseño de la configuración de equipos, distribución de productos,\nasesoramiento en el cumplimiento y evaluación de personal. La IA está contribuyendo engran medida en la organización, planificación de la gestión y control de las operaci ones,\ny continuará haciéndolo con más frecuencia a medida que se refinan los programas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "58", "text": "La IA está contribuyendo engran medida en la organización, planificación de la gestión y control de las operaci ones,\ny continuará haciéndolo con más frecuencia a medida que se refinan los programas. La IA también es influyente en la ciencia y la ingeniería, las aplicacionesdesarrolladas se utilizan para organizar y manipular las cantidades cada vez mayores de\ninformación disponibles para los científicos e ingenieros, se emplea en clasificacionesbiológicas, en la creación de circuitos semiconductores y componentes de automóviles. La IA se utiliza en la difracción y análisis de imágenes, en las plantas de energía y en el\ndiseño de las estaciones espaciales, uno de sus mayores usos es en la robótica.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "59", "text": "componentes de automóviles. La IA se utiliza en la difracción y análisis de imágenes, en las plantas de energía y en el\ndiseño de las estaciones espaciales, uno de sus mayores usos es en la robótica. Por la cantidad de habitantes que viven en el planeta tierra cada vez más senecesita usar de forma eficiente los recursos materiales y humanos, para lo cual podemos\nutilizar el poder que tienen las computadoras y la IA, en la agricultura para controlarplagas y manejar cultivos en forma más eficiente; en las fábricas en la realización de\nmontajes pelig rosos y actividades tediosas (labores de inspección y mantenimiento); enmedicina en el diagnóstico a pacientes, detectar pacientes que están en mayor riesgo de\ncomplicaciones, supervisar la condición de los pacientes, descubrir sutiles interaccionesentre los medicamentos que ponen a los pacientes en riesgo de sufrir efectos secundarios\ngraves, administrar tratamientos y preparar estudios estadísticos; en el trabajo domésticoasistir en la limpieza de la casa, preparación de alimentos, a brindar asesoría acerca de\ndietas, compras, supervisión y gestión de consumo energético y seguridad del hogar; enlas escuelas apoyar en la formación de los estudiantes, especialmente en aquellas materias\nconsideradas complejas; colaborar con los humanos expertos en el aná lisis para lasolución de problemas difíciles o en el diseño de nuevos dispositivos.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "60", "text": "especialmente en aquellas materias\nconsideradas complejas; colaborar con los humanos expertos en el aná lisis para lasolución de problemas difíciles o en el diseño de nuevos dispositivos. Se ha convertido en algo común de nuestras vidas el uso del GPS (GlobalPositioning System) para escoger la mejor ruta, recibir estados del tráfico, usar teléfonos\ninteligentes que entienden nuestro lenguaje, asistentes inteligentes como Cortana deMicroso ft y Siri de Apple; la búsqueda inteligente que realiza el buscador de Google y\nBing, el traductor y lector de documentos de Google. Algoritmos inteligentes que detectanlos rostros mientras estamos tomando una foto con el celular y reconocen las caras de las\npersonas cuando se publican las fotos en Facebook. Los usuarios de Amazon recibenrecomendaciones sobre libros, los de Netflix sobre películas. Aceleración de las portátiles\nal adivinar lo que se hará a continuación. Los coches inteligentes que se cond ucen a símismos, que pueden enfrentar situaciones complicadas, que reconocen la voz para una\ninteracción natural, que están desarrollando BMW, Tes la, Google.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "61", "text": "Los coches inteligentes que se cond ucen a símismos, que pueden enfrentar situaciones complicadas, que reconocen la voz para una\ninteracción natural, que están desarrollando BMW, Tes la, Google. La lucha contra elspam (correo basura) a través de clasificadores bayesianos y otras técnicas pr obabilísticas\nhan mostrado su eficacia. Los militares están usando aviones no tripulados, drones yrobots para investigar en lugares peligrosos. En la actualidad existe d ispositivos con IA que permiten que l a gente ciega vea,\nlos sordos escuchen, y los discapacitados y ancianos puedan caminar, e incluso correr. Las galaxias están siendo exploradas en mutuo apoyo entre los astrónomos\nexperimentados y las máquinas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "62", "text": "vea,\nlos sordos escuchen, y los discapacitados y ancianos puedan caminar, e incluso correr. Las galaxias están siendo exploradas en mutuo apoyo entre los astrónomos\nexperimentados y las máquinas. La presen cia de los métodos de Inteligencia artificial ha puesto a los sereshumanos a pensar en los riesgos potenciales de sus avances, piensan algunas personas\nque los sistemas de IA se podrían convertir en superinteligentes y poner en peligro lasupervivencia de la humanidad, pero se tiene a la AAAI (Association for the\nAdvancement of Artificial Intelligence) que está encargada de incentivar el avance en laciencia y tecnología de la inteligencia artificial y promocionar su uso responsable . Los errores de programación en software de inteligencia artificial deben serconsiderados, por lo que se requiere de la verificación y validación del software debido a\nla creciente complejidad y el uso en funciones delicadas como en automóviles, robotsquirúrgicos y sistemas de armas. Un desafío técnico es garantizar que los sistemas\nintegrados de forma automática a través de métodos estadísticos se comportencorrectamente en el proceso de aprendizaje automático.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "63", "text": "sistemas de armas. Un desafío técnico es garantizar que los sistemas\nintegrados de forma automática a través de métodos estadísticos se comportencorrectamente en el proceso de aprendizaje automático. Otro desafío es garantizar el buen\ncomporta miento cuando un sistema de IA se encuentra con situaciones imprevistas. Losvehículos automatizados, robots para el hogar, y los servicios inteligentes en la nube\ndeben funcionar bien, incluso cuando reciben insumos sorprendentes o confusos (Lalandaet al., 2013) . Otro riesgo que está presente son los ciberataques a los cuales los programas deIA son también vulnerables, y si se piensa en lo que podría suceder al estar los algoritmos\nde IA encargados de tomar decisiones de alto poder. Por lo que se requiere la investigación en seguridad cibernética para estar seguros que los algoritmos de IA y los\nsistemas que se desarrollan basados en estos pueden sobrevivir los ataques cibernéticos agran escala.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "64", "text": "la investigación en seguridad cibernética para estar seguros que los algoritmos de IA y los\nsistemas que se desarrollan basados en estos pueden sobrevivir los ataques cibernéticos agran escala. Un aspecto importante de cualquier sistema de IA que interactúa con la gente es que debe razonar sobre lo que las personas piensan en lugar de llevar a cabo los comandos\nde manera literal, para juzgar si lo que se le pide que realice es normal o razonable parala mayoría de la gente.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "65", "text": "1.5 Turing y la Evaluación de la Inteligencia de las Máquinas\nTuring (1912 -1954) propuso la Máquina Niño, en la\nque se crearía un agente inteligente básico y se sometería a uncurso de educación para proporcionarle conocimiento. En su\nartículo de 1950, \"Computing machinery and intelligence\",\nTuring (\nconclusiones aun cuando existe incertidumbre. El Aprendizaje automá tico permite a las máquinas adaptarse a nuevascircunstancias, detectar y extrapolar patrones . Permite que las máquinas sean capaces de\naprender cosas nuevas, de adaptarse al medio; para lo cual en la actualidad se usantécnicas basadas en redes neuronales y métodos probabilísticos como las redes bayesianas\no de Markov (Croitoru et al., 2018) . La Visión computacional , es una disciplina esencial, porque capacita a sistemasinteligentes para percibir objetos y comprender su entorno a través de imágenes. Su\ndesarrollo persigue la ambiciosa meta de igualar la capacidad de percepción visualhumana utilizando medios electró nicos para interpretar y comprender imágenes.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "66", "text": "su entorno a través de imágenes. Su\ndesarrollo persigue la ambiciosa meta de igualar la capacidad de percepción visualhumana utilizando medios electró nicos para interpretar y comprender imágenes. La\ncomprensión de la imagen se puede considerar como el proceso de esclareser informaciónsimbólica a partir de los datos visuales, empleando modelos que se fundamentan en\nprincipios de geometría, física, estad ística y teoría del aprendizaje. La Robótica , usada para manipular y mover objetos, tomando en cuenta el peso ,\nla forma, la presión que debe aplicar se para no dañar el objeto y saber los movimientos arealizar para trasladar el objeto a su destino. En el presente constituyen máquinas\nautomatizadas que pueden tomar el lugar de los humanos en entornos peligrosos oprocesos de fabricación, o parecerse a los humanos en apariencia en el comportamiento\ny la cognición.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "67", "text": "1.6 Agentes inteligentes\nEl paradigma principal en el campo de la Inteligencia Artificial es el modeloracional, que sostiene que una máquina es considerada inteligente si piensa y se comporta\nde manera racional. Este enfoque se apoya en técnicas de lógica y en el concepto deagen tes desarrollado por Russelll y Norvig. Los agentes toman decisiones basadas en el\nrazonamiento y las conclusiones extraídas de la información disponible, priorizando laopción más conveniente en función de los datos y el tiempo disponible. El agente humano tiene un cuerpo con un conjunto de sensores que incluye lavisión, la audición, el olfato, el gusto, la piel, el sentido vestibular para el equilibrio, la\nnocicepción relacionada al dolor, también tiene una serie de sistemas actuadores queincluyen dedos, brazos y piernas y o tros sistemas de control motores como el cerebro y\nel sistema nervioso central. En el ámbito de la Inteligencia Artificial, un agente inteligente, también conocido\ncomo agente , es una entidad autónoma que existe en un entorno y se guía por la\ninformación que recibe a través de sensores. Actúa de manera racional utilizandoactuadores para llevar a cabo acciones.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "68", "text": "agente , es una entidad autónoma que existe en un entorno y se guía por la\ninformación que recibe a través de sensores. Actúa de manera racional utilizandoactuadores para llevar a cabo acciones. En un instante dado, un agente toma decisiones\nbasadas en la secuen cia completa de percepciones que ha recibido hasta ese momento. Para realizar esta tarea, utiliza un sistema de control que mapea las percepciones enacciones (\nopciones que pueden elegirse en cualquier estado dado, y su elección tiene un impacto\ndirecto en cómo evoluci ona el agente en el entorno. Un agente racional debe tomar decisiones informadas y eficientes, considerandolas percepciones y el conocimiento disponible, con el fin de maximizar la consecución de\nsus objetivos. Al observar el entorno y tomar de decisiones adecuadas, el agente puedeadaptarse y aprender a actuar de manera más inteligente en situaciones futuras. La capacidad de un agente para seleccionar las acciones más apropiadas en cadaestado y lograr un rendimiento satisfactorio es un desafío importante en el campo de la\ninteligencia artificial.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "69", "text": "futuras. La capacidad de un agente para seleccionar las acciones más apropiadas en cadaestado y lograr un rendimiento satisfactorio es un desafío importante en el campo de la\ninteligencia artificial. Los investigadores y expertos en IA se dedican a desarrollar algoritmos y técnicas que permitan a los agentes racionales tomar decisiones óptimas en una amplia variedad\nde situaciones, contribuyendo así al avance y aplicación de esta disciplina. Estas acciones permiten al agente interactuar y modificar su estado en el entorno,\nbuscando lograr un objetivo específico. La capacidad de seleccionar las acciones másadecuadas en función de un estado dado es esencial para que el agente resuelva\nproblemas , tome decisiones informadas y maximice su rendimiento en el entorno en elque se encuentra. En el campo de la Inteligencia Artificial, se desarrollan algoritmos y técnicas quepermiten a los agentes racionales determinar de manera eficiente las acciones disponibles\nen cada estado y tomar decisiones óptimas para alcanzar sus metas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "70", "text": "se desarrollan algoritmos y técnicas quepermiten a los agentes racionales determinar de manera eficiente las acciones disponibles\nen cada estado y tomar decisiones óptimas para alcanzar sus metas. El estudio y av ancede estas capacidades de toma de decisiones en la IA contribuyen al desarrollo de sistemas\nmás inteligentes y eficientes en diversos dominios de aplicación. La secuencia de estados se muestra a continuación con otro ejemplo . Se tiene ntres recipientes (figura 1. 6), cuyas capacidades son doce litros, ocho litros y tres litros,\nademás un grifo de agua. Se desea obtener un litro de agua utilizando los recipientes, paralo cual puede llenar los recipientes o vaciar d e un recipiente a otro, o vaciar el agua de un\nrecipiente en el suelo. Existen algunas secuencias de estados que se pueden seguir, acontinuación, se muestra una de ellas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "71", "text": "28 (Estado intermedio)\n[1,0,0] En el recipiente de 12 litros queda el 1 litro de agua, como las otrascantidades de líquido no son las buscadas se derrama en el suelo (Estado final)\nEste ejemplo muestra una secuencia de estados que nos permite obtener un litrode agua utilizando los recipientes mencionados. Cada estado representa una\nconfiguración específica de los recipientes y las acciones realizadas (llenar, transferir,\nvaciar) nos permiten llegar al estado deseado. Este tipo de problemas de razonamiento yplanificación son abordados mediante técnicas de inteligencia artificial, que permiten\nencontrar soluciones óptimas o aproximadas a través de algoritmos específicos.\nLa capacidad de representar y manipular estados, así como de planificarsecuencias de acciones para lograr un objetivo, es fundamental en el campo de la IA.\nEstas habilidades permiten a los sistemas inteligentes resolver problemas complejos ytomar decisio nes informadas en una amplia variedad de dominios, des de problemas de\noptimización hasta tareas de planificación y control.\nPara el diseño del agente se establecen cuatro factores que se describen acontinuación en la tabla 1 -1.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "72", "text": "Tabla 1-1 Factores de diseño\nFactores de\ndiseño Conceptualización\nMedida de\nrendimiento Quien define la medida de rendimiento es el diseñador del agente,\nel cual establece los requisitos y objetivos específicos en función delentorno donde va a trabajar el agente, incluyendo métricas como la\nprecisión (qué tan correctas son las acciones o respuestas del agente),\neficiencia (qué cantidad de recursos que consume el agente pararealizar su tarea), velocidad de reacción(qué tan rápido puede\nresponder o actuar el agente) y la satisfacción del usuario (cómo sesienten los usuarios acerca de las interacciones con el agente). Estas\nmétricas sirven para que el diseñador ajuste y calibre a decuadamente el agente. Entorno de\ntrabajo El entorno de trabajo es la estructura física, lógica y digital dondeel agente realiza sus tareas y toma decisiones, es el lugar donde\ninteractúa con objetos y entidades presentes (otros agentes, humanos,\nherramientas); el diseñador debe identificar posibles problemas que\nel agente tiene que enfrentar y proceder a desarrollar estrategias yalgoritmos que permitan que pueda el agente realizar sus tareas de\nmanera eficiente y competitiva.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "73", "text": "posibles problemas que\nel agente tiene que enfrentar y proceder a desarrollar estrategias yalgoritmos que permitan que pueda el agente realizar sus tareas de\nmanera eficiente y competitiva. Percepciones Las percepciones es la capacidad del agente para obtenerinformación del medio ambiente que lo rodea a través de sensores. Los sensores son los dispositivos que permiten al agente captar datos y señales del entorno, que le proporcionan información al agent e\nsobre diferentes aspectos como el estado físico, la presencia deobjetos, eventos o cualquier otro tipo de estímulo relevante. Mediante estos datos el agente pueda comprender y tomar decisionesadecuadas en su entorno. Acciones Las acciones representan el efecto que tiene el agente sobre sumedio ambiente, utilizando actuadores, estos son dispositivos o\nmecanismos que permiten al agente interactuar físicamente con elentorno y realizar cambios o ejecutar acciones específicas. Est os\nactuadores pueden variar según el tipo de agente y la aplicación parala cual están destinados, e incluir elementos como motores, brazos\nrobóticos, sistemas de manipulación, entre otros.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "74", "text": "Est os\nactuadores pueden variar según el tipo de agente y la aplicación parala cual están destinados, e incluir elementos como motores, brazos\nrobóticos, sistemas de manipulación, entre otros. La capacidad de realizar acciones al agente le permite manifestarsu comportamiento y llevar a cabo tareas en su entorno. El agente\nmediante los actuadores, puede realizar acciones como moverobjetos, desplazarse en el espacio, modificar configuraciones o\nejecutar cualquier otra acción física requerida en el contexto. En el diseño del agente denominado robot que juega al futbol (\nsatisfaga un conjunto de restricciones definidas. Después de las suficientes experiencias interaccionando con el entorno, elcomportamiento del agente racional será independiente del conocimiento que poseía\ninicialmente. Esto significa que el agente ha adquirido la capacidad de adaptarse yresponder de manera inteligente a diferentes situaciones sin depender únicamente de\nsu conocimiento previo.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "75", "text": "1.7.1 Propiedades del entorno de trabajo\nLas propiedades del entorno de trabajo se refieren a las características y cualidades del ambiente en donde un agente o sistema de inteligencia artificial ejecuta sus acciones.\nLas propiedades del entorno influyen en cómo un agente puede percibir y actuar, y puedenvariar ampliamente según la aplicación específica. Es necesario categorizar los entornos\nde trabajo (Tabla 1 -2) en los que el agente inteligente va a desenvolverse, esto ayuda en\nsu diseño .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "76", "text": "Tabla 1-2 Propiedades del entorno de trabajo y ejemplos de agentes", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "77", "text": "ENTORNO CARACTERÍSTICAS EJEMPLOS", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "78", "text": "DE AGENTES\nTotalmente\nobservable\nEn un entorno totalmente observable,\nlos sensores del agente debenproporcionar una representación\ncompleta y fiable del estado del medioambiente en que se desenvuelve, en\ncada momento. El agente debe detectary capturar todos los aspectos que son\nrelevantes en la toma de decisiones queestán en función de las medidas de\nrendimiento (MacKay, 2003) . En estosentornos el agente no necesita\nmantener nin gún estado interno parasaber qué sucede en el mundo. Al existir una visión integral ydetallada del estado actual, se facilita la\ntoma de decisiones informadas sin o Ayudante dematemáticas\no Juego de Ajedrezo Sistema de\nNavegación GPS\no Laberinto con\nvisibilidad completa\no Sistema de\nMonitoreo de\nSensores\no Agente de\nreconocimiento de\no seguimiento de\nobjetos\no análisis de datos\nincertidumbre, el agente no requiere\nmantener un histórico para completarla información faltante o inferir\naspectos ocultos del entorno.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "79", "text": "de\no seguimiento de\nobjetos\no análisis de datos\nincertidumbre, el agente no requiere\nmantener un histórico para completarla información faltante o inferir\naspectos ocultos del entorno. Lacapacidad de observación completa y\nsin limitaciones brinda al agente unaventaja al comprender de manera\nprecisa e l contexto en el que actúa ,\npoder tomar decisiones adecuadas entiempo real y realizar cálculos exactos\ndel beneficio, importancia de unadeterminada acción, o la recompensa\nesperada basado en el estadoobservable . o control de calidad\no reconocimiento\nfacial\nParcialmente\nobservable En los entornos parcialmenteobservables la percepción del agente es\nafectada por la presencia de ruido\n(Lindley, 2013) o la utilización desensores poco exactos o porque el\nagente no recibe información completadel sistema ; esta percepción limitada o\nincompleta le dificulta la obtención deuna visión global y precisa del estado\ndel entorno , pudiendo generarincertidumbre en el agente. El agente al no tener acceso a unarepresentación directa y completa del\nestado en el que se encuentra , se veobligado a realizar inferencias y\nestimaciones para obtener unacomprensión aproximada del estado\nactual.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "80", "text": "tener acceso a unarepresentación directa y completa del\nestado en el que se encuentra , se veobligado a realizar inferencias y\nestimaciones para obtener unacomprensión aproximada del estado\nactual. En búsqueda de enfrentar esta o Pokero Tráfico en tiempo\no Laberinto con\nvisibilidad limitada\no Predicción del climao Robot que juega al\nfutbol\no Juego del veintiuno\n(Black jack) . o Robot clasificador\nde baldosas\no Robot de limpiezaautónomo\no Asistente virtual\ninteligente\no reconocimiento de\nobjetos\nsituación se debe incluir la utilización\nde algoritmos de filtrado que procesensecuencias de datos ruidosos o\nincompletos y técnicas de fusión dedatos que combinen la información\nentregada por los sensores de tal formaque se pueda mejorar la precisión de la\npercepción. o Sistema dedetección y\nprevención de\nfraudes\no diagnóstico médico\nDeterminista En los entornos deterministas, elsiguiente estado del medio ambiente\nestá totalmente determinado por laacción realizada en el estado actu al. Al\nejecuta r una acción específica, elresultado o estado siguiente del\nentorno es predecible de maneraprecisa y no hay incertidumbre\ninvolucrada (Samuel, 1959) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "81", "text": "realizada en el estado actu al. Al\nejecuta r una acción específica, elresultado o estado siguiente del\nentorno es predecible de maneraprecisa y no hay incertidumbre\ninvolucrada (Samuel, 1959) . Larelación causa -efecto entre las acciones\ndel agente y los estados del entorno ,\nnos indica, que cualquier acción que elagente realice tiene un resultado\nespecífico y directo en el entorno. o Ayudante dematemáticas\no Juego de ajedrezo Laberinto sin\nobstáculos móviles\no Operaciones\nmatemáticas\no Control de sistemasfísicos\nEstocástico En los entornos estocásticos, elcambio del entorno está sujeto a cierto\ngrado de aleatoriedad o incertidumbredebido a las acciones del agente ;\naunque el agente tome una acciónespecífica, el resultado o estado\nsiguiente del entorno no puedapredecirse con total certeza, este puede\nvariar debido a factores aleatorios o nocompletamente conocidos así se o Robot que juega al\nfutbol . o Robot clasificador\nde baldosas\no Mercados\nfinancieros\no Tráfico de vehículoso Clima\no Juego de póker\nconozca el estado actual .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "82", "text": "o nocompletamente conocidos así se o Robot que juega al\nfutbol . o Robot clasificador\nde baldosas\no Mercados\nfinancieros\no Tráfico de vehículoso Clima\no Juego de póker\nconozca el estado actual . Debido a l a incertidumbre presenteen el entorno estocástico, la\nprobabilidad de los diferentesresultados puede mode larse utilizando\nmodelos probabilísticos para tomardecisiones informadas y racionales. Estratégico En los entornos estratégicos, elmedio ambiente es determinista para el\nagente, lo que significa que el estadosiguiente del entorno está\ncompletamente determinado por lasacciones del agente. Al existir otros agentes en el entornose introduce cierto nivel de\nincertidumbre estratégica , debido a quelas acciones de los otros agentes\npueden influir en el estado siguientedel entorno de manera impredecible ;\nesto requiere que el agente considerediferentes estrategias y tome\ndecisiones adaptativas para enfrentarlos posibles resultados de las acciones\nde los otros agentes. Para lograr el agente sus objetivos enestos entornos que son dinámicos y\ncompetitivos, deben poder analizar yanticipar las acciones de los otros\nagentes.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "83", "text": "de las acciones\nde los otros agentes. Para lograr el agente sus objetivos enestos entornos que son dinámicos y\ncompetitivos, deben poder analizar yanticipar las acciones de los otros\nagentes. o Juego del veintiuno\n(black jack)\no Ajedrez\no Poker\no Negociación y\nsubastas\no Competencia\nempresarial\no Estrategia militar\no Videojuegos de\nestrategia en tiempo\nreal (RTS)\no Planificación\nlogística\no Sistemas de gestiónde tráfico\no Simuladores de\nEpisódico En un entorno episódico, cada estadoen el que se encuentra el agente no\ndepende de los estados anteriores, por o Búsqueda enlaberintos\no Robot clasificador\nlo que una acción realizada en un\nestado no tiene influencia en losestados futuros, cada estado constituye\nun episodio atómico. El agente no tieneuna memoria de larga duración y cada\ninteracción con el entorno se consideracomo un episodio separado e\nindependiente. Para la toma de decisiones y realiza racciones el agente se basa únicamente\nen la información disponible en elestado actual, sin tener en cuenta el\nhistorial de estados o acciones pasadas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "84", "text": "Para la toma de decisiones y realiza racciones el agente se basa únicamente\nen la información disponible en elestado actual, sin tener en cuenta el\nhistorial de estados o acciones pasadas. Esto simplifica el mode lado y lasolución de problemas en entornos en\nlos que la secuencia de acciones notiene una influencia acumulativa en los\nresultados futuros. de baldosaso Recolección de\nobjetos\no Juegos de cartascomo el Solitario\no Juegos de\nplataformas (Super\nMario Bros)\no Juegos de escapeo Simulaciones de\nemergencias\no Juegos de rol\n(Dungeons &\nDragons)\no Juegos de lógica yacertijos\nSecuencial En los entornos secuenciales, lasdecisiones tomadas en un momento\ndado pueden afectar a las decisiones yresultados futuros, cada estado\ndepende del histórico anterior. El agente debe evaluar no solo el impacto inmediato que tienen sus\nacciones, sino también considerarcuidadosamente las consecuencias de\nsus acciones y tomar decisionesestratégicas para maximizar su\nrendimiento total en el transcurso deltiempo.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "85", "text": "que tienen sus\nacciones, sino también considerarcuidadosamente las consecuencias de\nsus acciones y tomar decisionesestratégicas para maximizar su\nrendimiento total en el transcurso deltiempo. La secuencialidad y la necesidad de o Navegación en unentorno\ndesconocido\no Juegos de ajedrezo Toma de decisiones\nen tiempo real\no Robot que juega alfutbol\no Ayudante de\nmatemáticas\no Juego del veintiuno\n(Black jack)\no Sistemas de controlde inventario\nplanificación a largo plazo hacen que\nestos entornos de trabajo sean másdesafiantes y requieran algoritmos y\nenfoques especializados para la tomade decisiones y el control inteligente\ndel agente , que maximice losresultados positivos a lo largo del\ntiempo. o Planificación yprogramación de\no Juegos de aventuraso exploración\nEstático En un entorno estático, mientras elagente delibera sobre la acción\nsiguiente el entorno no cambia. Elagente no tiene que enfrentarse con\ncambios inesperados o dinámicos en suentorno mientras toma decisiones o\nrealiza acciones. Los entornos estáticosson más fáciles de entender y predeci r,\nfacilitando el diseño de los agentes yalgoritmos que funcionan\neficientemente en estos entornos .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "86", "text": "toma decisiones o\nrealiza acciones. Los entornos estáticosson más fáciles de entender y predeci r,\nfacilitando el diseño de los agentes yalgoritmos que funcionan\neficientemente en estos entornos . o Juego del veintiuno\n(Black jack)\no Rompecabezas\no Laberinto\no Clasificación de\nimágenes\no Sistemas de\ndetección de spam\no Sistemas de filtradode contenido\no Sistemas de\ndiagnóstico médico\no Sistemas de\nrecomendación de\nproductos\no Análisis de datosfinancieros\nDinámico En los entornos dinámicos, elentorno puede experimentar cambios\nmientras el agente está considera ndo laacción futura que va a realizar . Estos\ncambios pueden ser el resultado deeventos externos, interacciones con\notros agentes o incluso como resultado o Robot que juega alfutbol\no Robot clasificador\nde baldosas\no Tráfico de\nvehículos\no Juego de ajedrez\nsus propias acciones. El agente, debe poder adaptarse ytomar decisiones en tiempo real a\nmedida que el entorno evoluciona. Debe ser capaz de detectar ycomprender los cambios en su entorno,\nactualizar su conocimiento y ajustar sucomportamiento en consecuencia.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "87", "text": "decisiones en tiempo real a\nmedida que el entorno evoluciona. Debe ser capaz de detectar ycomprender los cambios en su entorno,\nactualizar su conocimiento y ajustar sucomportamiento en consecuencia. Para hacer frente a los entornosdinámicos, los agentes utilizan técnicas\ncomo la monitorización constante delentorno, la detección de cambios, la\nplanificación en tiempo real y elaprendizaje adaptativo. Estas técnicas\nhacen que el agente tom e decisionesinformadas y adapte su estrategia a los\ncambios del entorno. o Simulaciones deo Sistemas de\natención médica\npersonalizada\no Sistemas de\nrecomendación\npersonalizada\no Sistemas de\nsimulación de vida\nartificial\no Sistemas de gestiónde energía\no Sistemas de\nlogística y\ndistribución\nSemi estático El entorno semiestático noexperimenta cambios significativos, se\nmantiene relativamente constante a lolargo del tiempo en términos de sus\ncaracterísticas físicas y deconfiguración . S in embargo, el\nrendimiento puede variar a medida quese desarrolla el agente, esto se debe a la\ncapacidad que tiene de aprender,\nadaptarse y mejorar en el tiempo.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "88", "text": "físicas y deconfiguración . S in embargo, el\nrendimiento puede variar a medida quese desarrolla el agente, esto se debe a la\ncapacidad que tiene de aprender,\nadaptarse y mejorar en el tiempo. El agente puede tambiénexperimentar mejoras en su capacidad\nde toma r decisiones, resol verproblemas o alcanzar sus objetivos a o Ayudante de\nmatemáticas\no Juegos de mesao Sistemas de gestión\nde inventario\no Planificación de\nrutas de transporte\no Configuración de\no Sistemas de\nrecomendación de\ncontenido\no Sistemas de gestiónde recursos\nmedida que adquiere experiencia y\nconocimiento. Los agentes para mejorar surendimiento utiliza n técnicas de\naprendizaje automático, optimización\ny toma de decisiones basadas en datos . naturaleso Sistemas de\nplanificación urbana\no Sistemas de\noptimización de\nenergía\no Sistemas de\natención al cliente\nDiscreto En los entornos discretos, el conjuntode estados, las acciones y percepciones\nque puede experimentar el agente ,\ncomo el espacio de búsqueda , sonfinitos y claramente definidos. El\nagente tiene un número limitado yespecífico de estados en los puede\nencontrarse, así como tambien unconjunto definido de acciones y\npercepciones que puede realizar yrecibir.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "89", "text": "claramente definidos. El\nagente tiene un número limitado yespecífico de estados en los puede\nencontrarse, así como tambien unconjunto definido de acciones y\npercepciones que puede realizar yrecibir. La discreción en los entornosproporciona una estructura clara y bien\ndefinida, que facilita la modelización yel análisis del comportamiento del\nagente. Los estados, acciones ypercepciones se pueden representar\nmediante variables discretas ocategorías e specíficas, que simplifica\nel diseño y la implementación dealgoritmos y estrategias de toma de\ndecisiones. Al tener un número finito de estados,\nacciones y percepciones, es posible o Ayudante dematemáticas\no Juego del veintiuno\n(Black jack)\no Juego de ajedrezo Sistema de\nnavegación en una\ncuadrícula\no Solución de puzleso Juego de laberintos\no Juego de estrategiapor turnos\no Juego de palabraso Tres en raya\no Juego de damaso Solución de\ncrucigramas\no Simulación de vidaartificial\no Simulación de\ntráfico peatonal\no Control de\ninventario\no Sistemas de control\nrealizar un mapeo detallado y\nsistemático de todas las posiblescombinaciones, lo que permite una\nplanificación precisa y una evaluacióncompleta de las estrategias del agente.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "90", "text": "Sistemas de control\nrealizar un mapeo detallado y\nsistemático de todas las posiblescombinaciones, lo que permite una\nplanificación precisa y una evaluacióncompleta de las estrategias del agente. La naturaleza discreta de los entornosproporciona una base sólida para la\naplicación de técnicas matemáticas ,\nalgoritmos de búsqueda, optimización y aprendizaje. Esto incluye métodos\ncomo los árboles de búsqueda,\nalgoritmos de programación dinámicay técnicas de aprendizaje automático\nbasadas en modelos discretos. de producción\nContinuo En los entornos continuos, el númerode estados posibles es extremadamente\namplio e incluso infinito. En eltranscurso d el tiempo, los estados del\nmedio ambiente experimentan cambioscontinuos, esto hace que la percepción\ndel agente en cada instante sea única yvaríe de forma continua. En\nconsecuencia, el agente se ve obligadotomar decisiones y acciones continuas\npara adaptarse y responder a estoscambios dinámicos. Dado que el número de estados esextenso , resulta imposible mapear y\nexplorar exhaustivamente todas lasposibilidades. Para poder abordar\nproblemas en entornos continuos esnecesario utilizar enfoques basados en o Robot que juega al\nfutbol .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "91", "text": ", resulta imposible mapear y\nexplorar exhaustivamente todas lasposibilidades. Para poder abordar\nproblemas en entornos continuos esnecesario utilizar enfoques basados en o Robot que juega al\nfutbol . o Robot clasificador\nde baldosas . o Sistema de controlde vuelo de un avión\no Brazo robótico\no Sistema de\nnavegación\nautónoma de\nvehículos\no Simulaciones de\nfísica\no Control de procesosindustriales\no Gestión de carteras de inversión\no Control de sistemas\ntécnicas como el análisis de funciones\nde valor, algoritmos de optimizaciónnumérica y métodos basados en\nmodelos probabilísticos ; que permitenrepresentar y aproximar los estados y\nacciones de manera continua , estofacilita la toma de decisiones mediante\nla maximización de una funciónobjetivo o la adaptación a patrones y\ncambios en el medio ambiente. En los entornos continuos, elaprendizaje y la adaptación es\nimportante . Los agentes inteligentesdeben ser capaces de aprender de la\nexperiencia y mejorar sus acciones enfunción de la retroalimentación\ncontinúa proporcionada por el entorno\n(Gelfond & Kahl, 2014) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "92", "text": ". Los agentes inteligentesdeben ser capaces de aprender de la\nexperiencia y mejorar sus acciones enfunción de la retroalimentación\ncontinúa proporcionada por el entorno\n(Gelfond & Kahl, 2014) . Es necesario el uso de técnicas deaprendizaje automático y algoritmos de\ncontrol adaptativo para ajustar ymejorar su rendimiento a medida que\ninteractúan con el medio ambiente. de energíarenovable\no Robot de\nmanipulación de\nobjetos\no Sistema de controlde tráfico aéreo\no Simulaciones de\nfluidos\no Optimización de\ncarreteras y\ntransporte\no Sistemas de\nrecomendación\npersonalizados\no Control de sistemas de energía\nrenovable\nAgente individual En los entornos de agente individual ,\nsolo un agente interactúa de maneraautónoma con el medio ambiente. Por\nlo tanto, no hay necesidad deinteracción o colaboración directa con\notros agentes, centr ándose toda laactividad en el agente principal.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "93", "text": "agente interactúa de maneraautónoma con el medio ambiente. Por\nlo tanto, no hay necesidad deinteracción o colaboración directa con\notros agentes, centr ándose toda laactividad en el agente principal. En estos escenarios, el agenteindividual asume la responsabilidad o Asistente virtual en\nun teléfono\ninteligente\no Robot de limpiezao Sistema de\nrecomendación de\npelículas\no Agente de comercioelectrónico\ncompleta de percibir su entorno, tomar\ndecisiones y ejecutar acciones que sealinien con su objetivo y las\ncondiciones específicas del entorno. Laausencia de interacciones directas con\notros agentes reduce la complejidad de las dinámicas de interacción y las\nestrategias a considerar. Aunque el agente trabaja de formaindividual, puede estar inmerso en\nesenarios donde existen otros agentes de forma indirecta, como sistemas\nautomatizados o programas desoftware que son importantes en la\nconfiguración o en el control delentorno. Aunque no interactúan\ndirectamente con el agente principal,\nestos elementos pueden afectarsignificativ amente las condiciones y\nrestricciones del entorno, perjudicandolas decisiones y acciones del agente\nindividual.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "94", "text": "con el agente principal,\nestos elementos pueden afectarsignificativ amente las condiciones y\nrestricciones del entorno, perjudicandolas decisiones y acciones del agente\nindividual. o Chatbot de servicioal cliente\no Robot clasificador\nde baldosas\no Asistente personal\nen un dispositivo\ndoméstico\ninteligente\no Agente de saludpersonal\no Agente de\nseguridad\ndoméstica\no Agente de\nentrenamiento\nfísico\no Agente de\naprendizaje de\nidiomas\nMultiagente En los entornos multiagente, estánpresentes dos o más agentes que\ninteractúan entre sí, pudiendocompetir, cooperar o una combinación\nde ambos. Estos agentes persegu enobjetivos y acciones independientes,\npudiendo generar dinámicas complejas y estratégicas en el entorno. En est os entornos, los agentespueden tener diferentes niveles de o Tráfico inteligente\no Simulaciones de\npoblaciones\no Robot que juega alfutbol\no Ayudante de\nmatemáticas . o Juego del veintiuno\n(Black jack)\no Juegos en línea\nconocimiento, habilidades y\ncapacidades, que influyan en sucomportamiento y toma de decisiones. Los agentes pueden estar equipadoscon sensores para percibir el entorno y\nactuadores para realizar acciones queafecten al entorno.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "95", "text": "que influyan en sucomportamiento y toma de decisiones. Los agentes pueden estar equipadoscon sensores para percibir el entorno y\nactuadores para realizar acciones queafecten al entorno. La interacción entre\nlos agentes puede ser directa oindirecta, y puede involucrar\ncomunicación, negociación,\ncoordinación o competencia. El comportamiento de los agentespuede ser determinista o estocástico,\nevoluciona do a lo largo del tiempo amedida que los agentes aprenden y se\nadaptan al entorno . o Sistemas denegociación\nelectrónica\no juegos competitivos\no Sistemas de\nrecomendación\ncolaborativa\no Sistemas de gestióndel tráfico aéreo\no Sistemas de\ncoordinación de\nrobots en almacenes\no Juegos de estrategiaen tiempo real en", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "96", "text": "1.7.2 Clas es de agentes\nA continuación, se describen algunos de los agentes utilizados en inteligencia artificial:\nAgentes inteligentes : Han transformado el diseño de las interfaces de usuariointeligentes, cuyo objetivo es reducir la sobrecarga de información del usuario. Para\nlograrlo, utilizan técnicas de filtrado de información basadas en el aprendizaje de lasnecesidades del usuario y las circunstancias en las que se realizan determinadas acciones\n(Brookshear & Brylow, 2020) . Por ejemplo, en las interfaces de correo electrónico, losagentes pueden notificar al usuario la llegada de un nuevo correo que le interesa , evitando\nla distracción de en mensajes no deseados. Las interfaces inteligentes aplican algoritmos de aprendizaje automático yprocesamiento de lenguaje natural en el análisis del contenido de los mensajes, en la\nidentifica ción de su relevancia y la presenta ción al usuario de únicamente la informaciónmás importante y pertinente. De esta manera, se mejora la eficiencia y la experiencia de l\nusuario , al evitar la necesidad de revisar manualmente grandes volúmenes deinformación.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "97", "text": "la informaciónmás importante y pertinente. De esta manera, se mejora la eficiencia y la experiencia de l\nusuario , al evitar la necesidad de revisar manualmente grandes volúmenes deinformación. Agentes sintéticos : Estos agentes h an revolucionado los entornos de realidad\nvirtual, especialmente en la industria del entretenimiento, como películas, programas detelevisión y publicidad , permit iendo generar imágenes por computadora que evitan la\nnecesidad de construir maquetas complicadas para efectos especiales o de alquilargrandes cantidades de vestuario para escenas con multitudes. La inteligencia artificial y las técnicas de generación de gráficos por computadorapermiten simular personajes y objetos virtuales de manera realista, adaptándose a las\nnecesidades de cada producción. La capacidad de trabajo autónomo que realizan estosagentes agiliza el proceso de producción y reduce los costos asociados. Ofrecen flexibilidad creativa al permitir la generación de mundos virtualesdetallados y escenas impactantes que antes serían difíciles o costosas de lograr , han\nabierto nuevas posibilidades en la creación de efectos visuales y en la representación desituaciones complejas .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "98", "text": "y escenas impactantes que antes serían difíciles o costosas de lograr , han\nabierto nuevas posibilidades en la creación de efectos visuales y en la representación desituaciones complejas . Agentes conversacionales: Llamados también Chatterbots son programasdiseñados para llevar a cabo conversaciones de forma auditiva o textual. Estos agentes\nencuentran aplicaciones en diversos campos, como el servicio al cliente y la adquisición de información. Su objetivo principal es simular la in teracción humana y brindar\nrespuestas relevantes y coherentes a través de la identificación de patrones en el lenguaje. Los primeros c hatterbots fue ro Eliza (1966) y Parry (1972) permitían mantenerconversaciones básicas con los usuarios . En la actualidad debido a los avances en\ninteligencia artificial y procesamiento del lenguaje natural , los modernos chatterbots soncapaces de comprender el contexto, analizar el tono y el significado de las palabras, e\nincluso aprender de las interacciones previas para mejorar sus respuestas. Los Chatterbots son ampliamente utilizados en aplicaciones de atención al cliente,\nasistentes virtuales y plataformas de chat en línea.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "99", "text": "de las interacciones previas para mejorar sus respuestas. Los Chatterbots son ampliamente utilizados en aplicaciones de atención al cliente,\nasistentes virtuales y plataformas de chat en línea. Su capacidad para mantenerconversaciones coherentes y proporcionar información relevante ha demostrado ser una\nherramie nta valiosa en la automatización de tareas y en la mejora de la experiencia delusuario. El lenguaje de marcas de Inteligencia Artificial (AIML - Artificial IntelligenceMarkup Language) es un intérprete que se utiliza para construir agentes conversacionales. AIML está especialmente diseñado para la creación de agentes de software con capacida dde comprensión y generación de lenguaje natural, conocidos como Alicebots. Estos\nagentes son capaces de mantener conversaciones con usuarios y proporcionar respuestas\nadecuadas en función de los patrones de entrada definidos en las categorías. Agentes móviles : Son agentes que tienen la capacidad de moverse o migrar de unhost a otro en un entorno distribuido , poseen autono mía, tienen la capacidad de aprender,\nde percibir su entorno y responder de forma oportuna (Eze, 2022) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "100", "text": "la capacidad de moverse o migrar de unhost a otro en un entorno distribuido , poseen autono mía, tienen la capacidad de aprender,\nde percibir su entorno y responder de forma oportuna (Eze, 2022) . Estos agentes puedenejecutarse en diferentes máquinas sin necesidad de llevar consigo su propio código, lo\nque les permite aprovechar recursos distribuidos de manera eficiente. Los agentes móviles son capaces de gestionar grandes volúmenes de información y facilitar la comunicación en tiempo real, esto hace que sean adecuados para aplicaciones\nque requieren interacciones dinámicas y respuestas rápidas. Estos agentes se utilizan endiversos contextos, como: supervisión y optimización de tráfico en las redes, sistemas de\nmonitoreo y control, optimización de recursos, distribución de tareas , aplicaciones decolaboración , motores de búsqueda, asistentes personales, aprendizaje en la n ube. Agentes reactivos simples: Estos agentes toman decisiones basándose únicamenteen la percepción actual del entorno, sin mantener un estado interno. Su comportamiento\nse basa en respuestas directas a los estímulos del entorno en tiempo real, sin considerar elpasado ni planificar el futuro de manera explícita.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "101", "text": "sin mantener un estado interno. Su comportamiento\nse basa en respuestas directas a los estímulos del entorno en tiempo real, sin considerar elpasado ni planificar el futuro de manera explícita. Estos agentes se centran en generar\nrespuestas rápidas y efectivas a situaciones presentes, sin tener en cuenta el historial . Estos agentes son adecuados en casos donde el estado actual del entornoproporciona suficiente información para tomar decisiones inmediatas. Son eficientes en\ntérminos de tiempo de respuesta y recursos computacionales, debido a que no requierenmantener un modelo interno ni realizar un procesamiento exhaustivo de la información. Ejemplos de agentes reactivos simples son: un termostato inteligente que tomadecisiones basándose únicamente en la información actual de la temperatura ambiente,\nun robot seguidor de línea que utiliza sensores para detectar una línea en el suelo y tomardecisiones en tiempo real para seguir la línea . Agentes reactivos basados en modelos: Estos agentes mantienen un modelointerno del mundo que utilizan para tomar decisiones. Este modelo es una representación\ninterna del estado del entorno y cómo evoluciona en respuesta a las acciones del agente.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "102", "text": "mantienen un modelointerno del mundo que utilizan para tomar decisiones. Este modelo es una representación\ninterna del estado del entorno y cómo evoluciona en respuesta a las acciones del agente. Estos agentes tienen la capacidad de anticipar los efectos de sus acciones yplanificar a corto plazo. Utilizan su modelo interno para simular diferentes secuencias de\nacciones posibles y evaluar los resultados esperados antes de tomar una decisión , esto les\npermite considerar las consecuencias a corto plazo y seleccionar la acción que mejor se\nalinee con sus objetivos o criterios de rendimiento. Los agentes reactivos basados en modelos son especialmente útiles en entornosdonde es necesario planificar y tomar decisiones considerando las consecuencias futuras. Por ejemplo, en un juego de ajedrez, el agente puede simular diferentes movimientos yevaluar cómo afectarían al tablero y a su posición futura. Esto les permite tomar\ndecisiones estratégicas y anticiparse a las jugadas del oponente (Knott, 2017) . Agentes basados en objetivos: Estos agentes tienen metas u objetivos bien claros de lo que desean alcanzar en su entorno.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "103", "text": "estratégicas y anticiparse a las jugadas del oponente (Knott, 2017) . Agentes basados en objetivos: Estos agentes tienen metas u objetivos bien claros de lo que desean alcanzar en su entorno. Se guían por la evaluación de su estado actual\nen relación con dichos objetivos y toman acciones que los acerquen a ellos. Estos agentes mantienen un modelo interno del estado del entorno y utilizan estemodelo para evaluar qué tan cerca están de alcanzar sus metas. Analizan las posibles\nacciones disponibles y seleccionan la que mejor se alinee con sus objetivos. Esta selecció nse basa en algún tipo de función de evaluación que considera factores como el costo, la\nutilidad o la probabilidad de éxito. A medida que el agente toma acciones y su estado cambia, vuelven a evaluar suposición en relación con los objetivos y ajusta n sus decisiones. También pueden\nconsiderar diferentes opciones y seleccionar la que maximice la probabilidad de alcanzarsus metas (MacKay, 2003) . Los agentes basados en objetivos son muy útiles en entornos en los que seestablecen metas claras y los caminos para lograrlas pueden ser diversos.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "104", "text": "probabilidad de alcanzarsus metas (MacKay, 2003) . Los agentes basados en objetivos son muy útiles en entornos en los que seestablecen metas claras y los caminos para lograrlas pueden ser diversos. Por ejemplo, en\nun sistema de planificación de rutas, un agente basado en objetivos si tiene como objetivollegar a un destino específico debe considerar diferentes rutas posibles en función del\ntiempo, la distancia o las restricciones de tráfico. Agentes basados en utilidad: Estos agentes evalúan las acciones posibles entérminos de su utilidad o valor esperado, tomando decisiones que maximizan dicha\nutilidad. La utilidad representa la medida de satisfacción o beneficio que el agente esperaobtener al tomar una determinada acción en un estado dado. Cada acción posible se evalúa\nen función de la utilidad esperada , que se ha estima do que proporcionará al agente. Estos agentes de inteligencia artificial no se limitan a evaluar únicamente losresultados inmediatos de sus acciones; también consideran cuidadosamente las\nimplicaciones a largo plazo y las probabilidades asociadas a cada posible resultado (Das,\n2008) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "105", "text": "a evaluar únicamente losresultados inmediatos de sus acciones; también consideran cuidadosamente las\nimplicaciones a largo plazo y las probabilidades asociadas a cada posible resultado (Das,\n2008) . Para ello, aplican modelos avanzados o funciones de utilidad que les permitencalcular la utilidad esperada de cada opción de acción, seleccionando aquella que\nmaximice su valor global. La función de utilidad incorpora una variedad de factores, incluyendo losobjetivos específicos del agente, los costes asociados a cada acción, los riesgos e\nincertidumbres presentes en el entorno, así como las preferencias propias del agente. Utilizando e sta función, el agente es capaz de asignar valores numéricos a diferentesacciones y realizar comparaciones objetivas entre ellas, lo que le facilita la toma de la\ndecisión más óptima y estratégica dentro del contexto en el que trabaja . Un ejemplo de aplicación de agentes basados en utilidad es en sistemas derecomendación, donde el agente busca maximizar la utilidad del usuario ofreciendo\nrecomendaciones personalizadas que se ajusten a sus preferencias y necesidades.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "106", "text": "basados en utilidad es en sistemas derecomendación, donde el agente busca maximizar la utilidad del usuario ofreciendo\nrecomendaciones personalizadas que se ajusten a sus preferencias y necesidades. Agentes basados en conocimiento: Estos agentes utilizan conocimiento expertoo reglas específicas para tomar decisiones, basándose en una base de conocimientos\npreviamente definida. Se trata de agentes que aplican razonamiento lógico y utilizanreglas o algoritmos específicos para resolver problemas o responder preguntas. El conocimiento experto proveni ente de expertos humanos en un dominioespecífico se captura y codifica en forma de reglas o declaraciones lógicas. Este\nconocimiento incluye hechos, reglas, relaciones y restricciones relevantes para el dominioen cuestión. Los agentes basados en conocimiento utilizan su acervo de informaciónespecializada para realizar inferencias complejas y tomar decisiones informadas. Emplean técnicas sofisticadas como la lógica proposicional, la lógica de predicados osistemas avanzados basados en reglas para procesar y razonar sobre el conocimiento\nacumulado, conduciéndoles a conclusiones lógicas y fundamentadas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "107", "text": "la lógica proposicional, la lógica de predicados osistemas avanzados basados en reglas para procesar y razonar sobre el conocimiento\nacumulado, conduciéndoles a conclusiones lógicas y fundamentadas. El proceso de toma de decisiones en estos agentes implica una búsquedameticulosa en su base de conocimientos para identificar reglas o hechos pertinentes a la\nsituación específica. Luego, aplican razonamiento lógico detallado para derivarconclusiones coh erentes. Estas conclusiones son trascendentales , debido a que guían al\nagente en la selección de acciones más adecuadas o en la generación de respuestasprecisas a los desafíos que enfrentan. Los agentes basados en conocimiento son especialmente útiles en dominios en los\nque se dispone de un conocimiento experto bien definido y estructurado. Se utiliza n ensistemas de diagnóstico médico, asistentes virtuales, sistemas de recomendación o en\ncualquier otro contexto en el que se requiera un razonamiento lógico basado enconocimiento específico. Agentes multiagente: Son sistemas compuestos por varios agentes individuales que interactúan y colaboran entre sí para lograr un objetivo común o resolver un problema\nde manera cooperativa.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "108", "text": "Agentes multiagente: Son sistemas compuestos por varios agentes individuales que interactúan y colaboran entre sí para lograr un objetivo común o resolver un problema\nde manera cooperativa. Cada agente en el sistema es autónomo y puede tener diferentescaracterísticas, habilid ades y conocimientos (Eze, 2022) . La interacción entre los agentes se llevarse a cabo a través de diferentesmecanismos, como la comunicación directa, el intercambio de información, la\nnegociación y la coordinación. Los agentes comparten conocimientos, realiza n tareasespecíficas, coopera n en la toma de decisiones y coordina n acciones para alcanzar un\nobjetivo conjunto. Los sistemas multiagente son utilizados en una amplia gama de aplicaciones,\ncomo la logística, el tráfico inteligente, la gestión de recursos, la robótica colaborativa ylos juegos en línea, entre otros. En estas aplicaciones, los agentes trabajan juntos p ara\nabordar problemas complejos que requieren la colaboración de múltiples entidades. Agentes basados en aprendizaje : Representan una categoría avanzada desistemas inteligentes, dotados de la capacidad de auto -mejora y adaptación a través de la\nexperiencia.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "109", "text": "de múltiples entidades. Agentes basados en aprendizaje : Representan una categoría avanzada desistemas inteligentes, dotados de la capacidad de auto -mejora y adaptación a través de la\nexperiencia. Estos agentes incorporan algoritmos de aprendizaje automático de últimageneración para procesar y aprender de los d atos obtenidos de su entorno. El proceso de aprendizaje en estos agentes es sofisticado e implica no solo elreconocimiento de patrones y la identificación de relaciones, sino también la extracción\ny análisis profundo de información pertinente de los datos de entrada. Aprenden medianteun proceso continuo de retroalimentación, donde comparan los resultados actuales con\nlos objetivos o resultados ideales, y ajustan sus métodos y estrategias en consecuencia. Con el tiempo, estos agentes evolucionan y optimizan su comportamiento,\ntomando decisiones cada vez más precisas y efectivas basadas en el cúmulo deexperiencias pasadas y el conocimiento acumulado. Esta capacidad de adaptación y\naprendizaje continuo los h ace extraordinariamente eficaces en una amplia variedad deentornos y aplicaciones.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "110", "text": "cúmulo deexperiencias pasadas y el conocimiento acumulado. Esta capacidad de adaptación y\naprendizaje continuo los h ace extraordinariamente eficaces en una amplia variedad deentornos y aplicaciones. Existen diversos métodos de aprendizaje utilizados por agentes basados en el\naprendizaje, cada uno con características y aplicaciones distintas. En el aprendizajesupervisado, los agentes trabajan con conjuntos de datos etiquetados, aprendiendo a\nclasifica r o predecir nuevos datos basándose en ejemplos previos (Xiao, 2022) . Por otrolado, en el aprendizaje no supervisado, los agentes exploran datos sin etiquetar para\ndescubrir patrones y estructuras ocultas por sí mismos. Mientras tanto, en el aprendizajepor refuerzo, los agentes mejoran su rendimiento interactuando direct amente con el\nentorno, siendo recompensados o penalizados según las consecuencias de sus acciones. Los agentes basados en aprendizaje tienen la notable capacidad de adaptarse yperfeccionar su desempeño con la exposición a más datos y experiencias. Estos sistemas\najustan continuamente sus modelos internos y estrategias, optimizando sucomportamiento par a alcanzar los objetivos.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "111", "text": "su desempeño con la exposición a más datos y experiencias. Estos sistemas\najustan continuamente sus modelos internos y estrategias, optimizando sucomportamiento par a alcanzar los objetivos. Estos agentes encuentran aplicación en una amplia gama de campos, incluyendoreconocimiento de voz, visión por computadora, recomendación de productos, análisis de\ngrandes conjuntos de datos y toma de decisiones en tiempo real. Mediante el uso de laprendizaje automático, estos agentes pueden procesar y aprender eficientemente de\ngrandes volúmenes de datos, adaptándose a entornos y requerimientos en constantecambio. Agentes basados en reglas: Son sistemas inteligentes que utilizan un conjunto dereglas predefinidas para tomar decisiones y realizar acciones en función de la información\ndisponible. Estas reglas pueden estar basadas en conocimiento experto o en reglas lógicas,\ny son diseñadas por expertos en el dominio específico del problema. El funcionamiento de estos agentes se basa en la evaluación de condiciones y laaplicación de acciones correspondientes.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "112", "text": "lógicas,\ny son diseñadas por expertos en el dominio específico del problema. El funcionamiento de estos agentes se basa en la evaluación de condiciones y laaplicación de acciones correspondientes. Cada regla consta de una condición o conjunto\nde condiciones que deben ser satisfechas para que la regla se aplique, y una acción que sellevará a cabo si se cump len las condiciones. Cuando un agente recibe información del entorno, evalúa las reglas una por unaen orden y verifica si las condiciones de cada regla se cumplen. Si encuentra una regla\ncuyas condiciones se satisfacen, el agente ejecuta la acción asociada a esa regla. Sininguna regla se cumple, el agente puede tener una regla predeterminada o una acción\npor defecto a realizar . Los agentes basados en reglas son especialmente útiles cuando el dominio del\nproblema es bien estructurado y se pueden identificar claramente las reglas que guían el\ncomportamiento del agente. Estos agentes son utilizados en sistemas expertos, donde elconocimiento de un experto en un campo específico se codifica en forma de reglas para\nrealizar tareas de diagnóstico, asesoramiento o toma de decisiones.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "113", "text": "son utilizados en sistemas expertos, donde elconocimiento de un experto en un campo específico se codifica en forma de reglas para\nrealizar tareas de diagnóstico, asesoramiento o toma de decisiones. Agentes basados en comportamiento: Estos sistemas inteligentes son diseñadospara emular el comportamiento de seres vivos, ya sea humano u otros organismos. Estos\nagentes se centran en replicar acciones y respuestas específicas en función de estímulos del entorno, con el objetivo de generar un comportamiento realista y coherente. El enfoque principal de estos agentes es la simulación de patrones decomportamiento observados en seres vivos. Estos patrones pueden incluir movimientos,\nreacciones a estímulos, toma de decisiones y acciones que se asemejan a las deorganismos reales. Para lograr lo, estos agentes suelen utilizar técnicas como los\nalgoritmos de inteligencia artificial y el mode lado de sistemas complejos. Los agentes basados en comportamiento son comunes en simulaciones y juegos,\ndonde se busca recrear entornos virtuales con comportamientos realistas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "114", "text": "artificial y el mode lado de sistemas complejos. Los agentes basados en comportamiento son comunes en simulaciones y juegos,\ndonde se busca recrear entornos virtuales con comportamientos realistas. Por ejemplo :\njuegos de simulación de vida, juegos de simulación de ciudades o de mascotas virtuales ;\nlos agentes basados en comportamiento pueden imitar acciones y respuestas similares alas de los seres vivos para proporcionar una experiencia de juego más inmersiva. Estos agentes también se utilizan en aplicaciones de entrenamiento y aprendizaje,\ndonde se busca replicar comportamientos específicos para fines educativos o deentrenamiento. Por ejemplo, en simuladores de vuelo, los agentes basados en\ncomportamiento pueden replicar las acciones y reacci ones de pilotos reales para enseñara los usuarios cómo operar una aeronave. Agentes híbridos: Estos agentes son sistemas inteligentes que combinancaracterísticas y técnicas de diferentes tipos de agentes que se mencionaron\nanteriormente. Estos agentes aprovechan las fortalezas de múltiples enfoques para lograrun desempeño óptimo en una variedad de situaciones.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "115", "text": "técnicas de diferentes tipos de agentes que se mencionaron\nanteriormente. Estos agentes aprovechan las fortalezas de múltiples enfoques para lograrun desempeño óptimo en una variedad de situaciones. La idea detrás de los agentes híbridos es capitalizar las ventajas de diferentesparadigmas de agente para abordar de manera efectiva problemas complejos y dinámicos. Por ejemplo, un agente híbrido puede combinar elementos de agentes reactivos y basadosen conocimiento. Esto significa que el agente toma decisiones rápidas y eficientes en\nsituaciones conocidas utilizando reglas o conocimiento predefinido, y también puede\nadaptarse y aprender de nuevas situaciones utilizando técnicas de aprendizaje automático. Otro ejemplo es un asistente virtual en un dispositivo móvil. Este agente puedeutilizar un enfoque reactivo para responder rápidamente a comandos de voz o preguntas\nfrecuentes, aprovechando patrones y reglas predefinidas. Al mismo tiempo, puedeincorporar técnicas de apr endizaje automático para mejorar su capacidad de entender el\ncontexto del usuario y brindar respuestas más personalizadas y precisas.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "116", "text": "predefinidas. Al mismo tiempo, puedeincorporar técnicas de apr endizaje automático para mejorar su capacidad de entender el\ncontexto del usuario y brindar respuestas más personalizadas y precisas. Cada tipo de agente tiene sus propias fortalezas y limitaciones, y la elección deltipo de agente adecuado dependerá del problema o la tarea específica que se esté\nabordando. La selección del tipo de agente correcto es fundamental para lograr unrendimient o óptimo en sistemas de Inteligencia Artificial.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "117", "text": "1.7.3 Arquitecturas de programas para agentes\nEstas arquitecturas se basan en los objetivos aplicativos del agente. Lasarquitecturas de agentes a ser revisadas son: arquitectura reactiva simpl e, arquitectura\ndeliberante , arquitectura por finalidad , arquitectura basada en el razonamiento humano ,\narquitectura de agente de reforzamiento, arquitectura de agente de aprendizaje profundo,\narquitectura de agente multiagente. a) Arquitectura reactiva simpleLa arquitectura reactiva simple es una forma básica de diseño de agentes en la que\nel comportamiento del agente se basa en una correspondencia directa entre el estímulorecibido y la respuesta generada. En esta arquitectura, el agente no posee habilidades de\ntoma de decisiones sofisticadas, sino que simplemente reacciona al entorno en el que seencuentra. El agente percibe el entorno a través de sensores y, en función de esa\npercepción, elige la acción más apropiada para interactuar con el entorno. Esta ele cción de acción se realiza mediante reglas de condición -acción (si -entonces), que establecen la\nconexión entre la percepción actual y la acción a tomar.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "118", "text": "para interactuar con el entorno. Esta ele cción de acción se realiza mediante reglas de condición -acción (si -entonces), que establecen la\nconexión entre la percepción actual y la acción a tomar. Esta arquitectura es adecuada para entornos simples donde las percepcioneshistóricas no son relevantes y solo se requiere una respuesta inmediata y directa al\nestímulo presente. Puede ser implementada en hardware o mediante software conalgoritmos de búsq ueda rápidos. Es importante destacar que esta arquitectura solo funciona correctamente enentornos totalmente observables, es decir, cuando el agente tiene acceso a toda la\ninformación relevante del entorno. Si hay partes del entorno que no son observables,\npueden surgir problemas debido a la falta de información completa para tomar decisiones\nprecisas. y el estado actual del entorno. Para esto, el agente recopila y analiza tanto la información\nsobre la evolución del entorno como las posibles consecuencias de sus acciones. el agente desea llegar, de modo que pueda evaluar si los estados intermedios alcanzados\npor las acciones tomadas lo acercarán o alejarán de su objetivo final. principal para alcanzar una meta deseada.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "119", "text": "agente desea llegar, de modo que pueda evaluar si los estados intermedios alcanzados\npor las acciones tomadas lo acercarán o alejarán de su objetivo final. principal para alcanzar una meta deseada. Para lograr esto, el agente necesita seleccionar\nuna o más acciones que modificarán el estado del medio ambiente con el fin de satisfacersu necesidad de alcanzar la meta. Esta toma de decisiones se realiza conside rando los\nobjetivos y evaluando cómo cada acción contribuirá a su logro. agente es maximizar la acumulación de estas recompensas a lo largo del tiempo. En el aprendizaje por refuerzo, surge un desafío fundamental: encontrar elequilibrio adecuado entre la exploración de nuevas acciones y la explotación de aquellas\nacciones que han demostrado producir recompensas significativas. El agente (\nla inteligencia artificial, fundamentada en el uso de redes neuronales profundas o DNN\n(Deep Neural Networks). Estas redes, compuestas por múltiples capas de neuronasartificiales interconectadas, están diseñadas para aprender de grandes volúmenes de datos\ny realizar tareas específicas de manera autónoma (Haykin, 2009) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "120", "text": "compuestas por múltiples capas de neuronasartificiales interconectadas, están diseñadas para aprender de grandes volúmenes de datos\ny realizar tareas específicas de manera autónoma (Haykin, 2009) . Imitando lacomplejidad del cerebro humano, estas redes permiten a las máquinas identificar\npatrones, realizar predicciones y resolver problemas complejos sin necesidad deintervención humana directa. El aprendizaje profundo, impulsado por estas redes, h a\nrevolucionado campos como el procesamiento de lenguaje natural, la visión porcomputadora, la generación de texto, los videojuegos, la traducción automática, la\nrobótica, la toma de decisiones y las simulaciones avanzadas. Una Red Neuronal Profunda se estructura en múltiples capas de neuronasartificiales. Cada capa consiste en un conjunto de neuronas, también conocidas como\nnodos o unidades, y se clasifican generalmente en tres categorías: la capa de entrada, unao varias c apas ocultas, y la capa de salida. La profundidad de estas redes se define por el\nnúmero de capas ocultas presentes entre la entrada y la salida.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "121", "text": "en tres categorías: la capa de entrada, unao varias c apas ocultas, y la capa de salida. La profundidad de estas redes se define por el\nnúmero de capas ocultas presentes entre la entrada y la salida. A mayor número de capasocultas, más 'profunda' se considera la red, lo que implica una mayor capacidad para\naprender características complejas y abstractas de los datos. la red) puede volverse inestable en redes profundas (Kowaliw et al., 2014) . Sin embargo,\nse han desarrollado técnicas como la normalización de lotes, funciones de activaciónapropiadas y optimizadores avanzados para abordar estos desafíos y permitir el\nentrenamiento eficiente. Además de las redes neuronales estándar existen las Redes NeuronalesConvolucionales (CNN) que son excelentes para el procesamiento de datos estructurados\na través de matrices bidimensionales , como la clasificación y segmentación de imágenes y las Redes Neuronales Recurrentes (RNN) que son efectivas para datos secuenciales,\ncomo el procesamiento de lenguaje natural (Haykin, 2009) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "122", "text": ", como la clasificación y segmentación de imágenes y las Redes Neuronales Recurrentes (RNN) que son efectivas para datos secuenciales,\ncomo el procesamiento de lenguaje natural (Haykin, 2009) . El Aprendizaje por Reforzamiento Profundo (DRL) es un subcampo esencial enel que los agentes emplean redes neuronales profundas para aprender a tomar decisiones\nsecuenciales en entornos interactivos, esto se logra a través de la retroalimentación derecompensas, donde la red es entrenada con el objetivo de maximizar las recompensas\nacumuladas a lo largo del tiempo. g) Arquitectura de agente multiagenteLa arquitectura multiagente (\nconocimiento particular y objetivos individuales, contribuyendo así a la eficacia y\nadaptabilidad del sistema en su conjunto . decisiones más efectivas. Este aprendizaje puede ser individual o colectivo, donde los\nagentes comparten conocimientos. Estas arquitecturas son adecuadas para mode lar entornos dinámicos donde lassituaciones cambian constantemente. Los agentes deben adaptarse y reaccionar en tiempo\nreal a nuevas circunstancias.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "123", "text": "Estas arquitecturas son adecuadas para mode lar entornos dinámicos donde lassituaciones cambian constantemente. Los agentes deben adaptarse y reaccionar en tiempo\nreal a nuevas circunstancias. La escalabilidad es un reto importante en sistemas con un gran número de agentes,\nla arquitectura debe ser eficiente para manejar múltiples agentes y garantizar unrendimiento adecuado.", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "124", "text": "1.8 El conocimiento\nEl razonamiento humano, que se fundamenta en el conocimiento acumulado paraderivar conclusiones, sirve como base para el desarrollo de sistemas en el campo de la\nInteligencia Artificial. En IA, la investigación se puede dividir en dos corrientesprincipales: la inteligencia simbólica y la inteligencia computacional. La inteligencia simbólica, también conocida como IA tradicional, se enfoca en la resolución de problemas mediante un razonamiento basado en conocimientos explícitos. Esta vertiente utiliza representaciones simbólicas y reglas lógicas para procesar información y deducir soluciones. Este enfoque se caracteriza por la programación de\nalgoritmos complejos y la manipulación de símbolos para emular tareas cognitivas. Por otro lado, la inteligencia computacional aborda la resolución de problemas a partir de la conexión y análisis de datos. Esta corriente incluye técnicas avanzadas como\nredes neuronales artificiales, algoritmos genéticos, sistemas difusos (fuzzy logic),\nprogramación evolutiva y vida artificial (Martinsanz & Peñas, 2005) .", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
{"id": "125", "text": "corriente incluye técnicas avanzadas como\nredes neuronales artificiales, algoritmos genéticos, sistemas difusos (fuzzy logic),\nprogramación evolutiva y vida artificial (Martinsanz & Peñas, 2005) . Estas técnicas se inspiran en el funcionamiento de sistemas biológicos y tienen como objetivo replicar su\ncapacidad innata de aprendizaje y adaptación, permitiendo a los sistemas de IA mejorar y evolucionar de forma autónoma. Ambas categorías de investigación en IA tienen sus propias fortalezas yaplicaciones. La inteligencia simbólica es efectiva para problemas que se pueden expresar\nen términos lógicos y que requieren razonamiento basado en reglas y conocimiento explícito. Po r otro lado, la inteligencia computacional es útil en problemas donde los datos\nson complejos y se requiere un enfoque más basado en el aprendizaje y la adaptación. La Inteligencia Artificial (IA) se puede entender como la ciencia que se ocupa de la ingeniería del conocimiento, abordando la representación, adquisición y aplicación del", "source": "FUNDAMENTO+DE+LA+IA+volumen+I_clean"}
